/* automatically generated by rust-bindgen 0.69.5 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const CURLU_DEFAULT_PORT: u32 = 1;
pub const CURLU_NO_DEFAULT_PORT: u32 = 2;
pub const CURLU_DEFAULT_SCHEME: u32 = 4;
pub const CURLU_NON_SUPPORT_SCHEME: u32 = 8;
pub const CURLU_PATH_AS_IS: u32 = 16;
pub const CURLU_DISALLOW_USER: u32 = 32;
pub const CURLU_URLDECODE: u32 = 64;
pub const CURLU_URLENCODE: u32 = 128;
pub const CURLU_APPENDQUERY: u32 = 256;
pub const CURLU_GUESS_SCHEME: u32 = 512;
pub const CURLU_NO_AUTHORITY: u32 = 1024;
pub const CURLU_ALLOW_SPACE: u32 = 2048;
pub const CURLU_PUNYCODE: u32 = 4096;
pub const CURLU_PUNY2IDN: u32 = 8192;
pub const CURLU_GET_EMPTY: u32 = 16384;
pub const CURLU_NO_GUESS_SCHEME: u32 = 32768;
pub const CURLOT_FLAG_ALIAS: u32 = 1;
pub const CURLH_HEADER: u32 = 1;
pub const CURLH_TRAILER: u32 = 2;
pub const CURLH_CONNECT: u32 = 4;
pub const CURLH_1XX: u32 = 8;
pub const CURLH_PSEUDO: u32 = 16;
pub const CURLWS_TEXT: u32 = 1;
pub const CURLWS_BINARY: u32 = 2;
pub const CURLWS_CONT: u32 = 4;
pub const CURLWS_CLOSE: u32 = 8;
pub const CURLWS_PING: u32 = 16;
pub const CURLWS_OFFSET: u32 = 32;
pub const CURLWS_PONG: u32 = 64;
pub const CURLWS_RAW_MODE: u32 = 1;
pub const CURLWS_NOAUTOPONG: u32 = 2;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    const UNINIT: ::std::mem::MaybeUninit<__sigset_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    const UNINIT: ::std::mem::MaybeUninit<timeval> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::std::mem::MaybeUninit<timespec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    const UNINIT: ::std::mem::MaybeUninit<fd_set> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__fds_bits) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___atomic_wide_counter__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__atomic_wide_counter__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__atomic_wide_counter__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__low) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__high) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___atomic_wide_counter() {
    const UNINIT: ::std::mem::MaybeUninit<__atomic_wide_counter> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Alignment of ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value32)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_internal_list> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__prev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_internal_slist> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_mutex_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__lock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__owner) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__nusers) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__kind) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__spins) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__elision) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__list) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_rwlock_arch_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__readers) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__writers) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wrphase_futex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__writers_futex) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad3) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad4) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__cur_writer) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__shared) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__rwelision) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad1) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad2) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__flags) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_cond_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wseq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g1_start) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_refs) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g1_orig_size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wrefs) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_signals) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___once_flag() {
    const UNINIT: ::std::mem::MaybeUninit<__once_flag> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__once_flag>(),
        4usize,
        concat!("Size of: ", stringify!(__once_flag))
    );
    assert_eq!(
        ::std::mem::align_of::<__once_flag>(),
        4usize,
        concat!("Alignment of ", stringify!(__once_flag))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__once_flag),
            "::",
            stringify!(__data)
        )
    );
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutexattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_condattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_attr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutex_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_cond_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlock_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlockattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_barrier_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_barrierattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[test]
fn bindgen_test_layout_iovec() {
    const UNINIT: ::std::mem::MaybeUninit<iovec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iovec>(),
        16usize,
        concat!("Size of: ", stringify!(iovec))
    );
    assert_eq!(
        ::std::mem::align_of::<iovec>(),
        8usize,
        concat!("Alignment of ", stringify!(iovec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iov_base) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iovec),
            "::",
            stringify!(iov_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iov_len) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iovec),
            "::",
            stringify!(iov_len)
        )
    );
}
pub type socklen_t = __socklen_t;
pub const __socket_type_SOCK_STREAM: __socket_type = 1;
pub const __socket_type_SOCK_DGRAM: __socket_type = 2;
pub const __socket_type_SOCK_RAW: __socket_type = 3;
pub const __socket_type_SOCK_RDM: __socket_type = 4;
pub const __socket_type_SOCK_SEQPACKET: __socket_type = 5;
pub const __socket_type_SOCK_DCCP: __socket_type = 6;
pub const __socket_type_SOCK_PACKET: __socket_type = 10;
pub const __socket_type_SOCK_CLOEXEC: __socket_type = 524288;
pub const __socket_type_SOCK_NONBLOCK: __socket_type = 2048;
pub type __socket_type = ::std::os::raw::c_uint;
pub type sa_family_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr {
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[test]
fn bindgen_test_layout_sockaddr() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr>(),
        16usize,
        concat!("Size of: ", stringify!(sockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr>(),
        2usize,
        concat!("Alignment of ", stringify!(sockaddr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr),
            "::",
            stringify!(sa_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_data) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr),
            "::",
            stringify!(sa_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_storage {
    pub ss_family: sa_family_t,
    pub __ss_padding: [::std::os::raw::c_char; 118usize],
    pub __ss_align: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_sockaddr_storage() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr_storage> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr_storage>(),
        128usize,
        concat!("Size of: ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_storage>(),
        8usize,
        concat!("Alignment of ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ss_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(ss_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ss_padding) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_padding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ss_align) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_align)
        )
    );
}
pub const MSG_OOB: _bindgen_ty_1 = 1;
pub const MSG_PEEK: _bindgen_ty_1 = 2;
pub const MSG_DONTROUTE: _bindgen_ty_1 = 4;
pub const MSG_CTRUNC: _bindgen_ty_1 = 8;
pub const MSG_PROXY: _bindgen_ty_1 = 16;
pub const MSG_TRUNC: _bindgen_ty_1 = 32;
pub const MSG_DONTWAIT: _bindgen_ty_1 = 64;
pub const MSG_EOR: _bindgen_ty_1 = 128;
pub const MSG_WAITALL: _bindgen_ty_1 = 256;
pub const MSG_FIN: _bindgen_ty_1 = 512;
pub const MSG_SYN: _bindgen_ty_1 = 1024;
pub const MSG_CONFIRM: _bindgen_ty_1 = 2048;
pub const MSG_RST: _bindgen_ty_1 = 4096;
pub const MSG_ERRQUEUE: _bindgen_ty_1 = 8192;
pub const MSG_NOSIGNAL: _bindgen_ty_1 = 16384;
pub const MSG_MORE: _bindgen_ty_1 = 32768;
pub const MSG_WAITFORONE: _bindgen_ty_1 = 65536;
pub const MSG_BATCH: _bindgen_ty_1 = 262144;
pub const MSG_ZEROCOPY: _bindgen_ty_1 = 67108864;
pub const MSG_FASTOPEN: _bindgen_ty_1 = 536870912;
pub const MSG_CMSG_CLOEXEC: _bindgen_ty_1 = 1073741824;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msghdr {
    pub msg_name: *mut ::std::os::raw::c_void,
    pub msg_namelen: socklen_t,
    pub msg_iov: *mut iovec,
    pub msg_iovlen: usize,
    pub msg_control: *mut ::std::os::raw::c_void,
    pub msg_controllen: usize,
    pub msg_flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_msghdr() {
    const UNINIT: ::std::mem::MaybeUninit<msghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<msghdr>(),
        56usize,
        concat!("Size of: ", stringify!(msghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<msghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(msghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_namelen) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_namelen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_iov) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_iov)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_iovlen) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_iovlen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_control) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_control)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_controllen) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_controllen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_flags) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_flags)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct cmsghdr {
    pub cmsg_len: usize,
    pub cmsg_level: ::std::os::raw::c_int,
    pub cmsg_type: ::std::os::raw::c_int,
    pub __cmsg_data: __IncompleteArrayField<::std::os::raw::c_uchar>,
}
#[test]
fn bindgen_test_layout_cmsghdr() {
    const UNINIT: ::std::mem::MaybeUninit<cmsghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cmsghdr>(),
        16usize,
        concat!("Size of: ", stringify!(cmsghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<cmsghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(cmsghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmsg_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(cmsg_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmsg_level) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(cmsg_level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmsg_type) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(cmsg_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__cmsg_data) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(__cmsg_data)
        )
    );
}
extern "C" {
    pub fn __cmsg_nxthdr(__mhdr: *mut msghdr, __cmsg: *mut cmsghdr) -> *mut cmsghdr;
}
pub const SCM_RIGHTS: _bindgen_ty_2 = 1;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fd_set {
    pub fds_bits: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___kernel_fd_set() {
    const UNINIT: ::std::mem::MaybeUninit<__kernel_fd_set> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__kernel_fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(__kernel_fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<__kernel_fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(__kernel_fd_set))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fds_bits) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__kernel_fd_set),
            "::",
            stringify!(fds_bits)
        )
    );
}
pub type __kernel_sighandler_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type __kernel_key_t = ::std::os::raw::c_int;
pub type __kernel_mqd_t = ::std::os::raw::c_int;
pub type __kernel_old_uid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_gid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_dev_t = ::std::os::raw::c_ulong;
pub type __kernel_long_t = ::std::os::raw::c_long;
pub type __kernel_ulong_t = ::std::os::raw::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_mode_t = ::std::os::raw::c_uint;
pub type __kernel_pid_t = ::std::os::raw::c_int;
pub type __kernel_ipc_pid_t = ::std::os::raw::c_int;
pub type __kernel_uid_t = ::std::os::raw::c_uint;
pub type __kernel_gid_t = ::std::os::raw::c_uint;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_daddr_t = ::std::os::raw::c_int;
pub type __kernel_uid32_t = ::std::os::raw::c_uint;
pub type __kernel_gid32_t = ::std::os::raw::c_uint;
pub type __kernel_size_t = __kernel_ulong_t;
pub type __kernel_ssize_t = __kernel_long_t;
pub type __kernel_ptrdiff_t = __kernel_long_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fsid_t {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___kernel_fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__kernel_fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__kernel_fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__kernel_fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__kernel_fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__kernel_fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__kernel_fsid_t),
            "::",
            stringify!(val)
        )
    );
}
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = ::std::os::raw::c_longlong;
pub type __kernel_old_time_t = __kernel_long_t;
pub type __kernel_time_t = __kernel_long_t;
pub type __kernel_time64_t = ::std::os::raw::c_longlong;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = ::std::os::raw::c_int;
pub type __kernel_clockid_t = ::std::os::raw::c_int;
pub type __kernel_caddr_t = *mut ::std::os::raw::c_char;
pub type __kernel_uid16_t = ::std::os::raw::c_ushort;
pub type __kernel_gid16_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct linger {
    pub l_onoff: ::std::os::raw::c_int,
    pub l_linger: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_linger() {
    const UNINIT: ::std::mem::MaybeUninit<linger> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<linger>(),
        8usize,
        concat!("Size of: ", stringify!(linger))
    );
    assert_eq!(
        ::std::mem::align_of::<linger>(),
        4usize,
        concat!("Alignment of ", stringify!(linger))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_onoff) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linger),
            "::",
            stringify!(l_onoff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_linger) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linger),
            "::",
            stringify!(l_linger)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct osockaddr {
    pub sa_family: ::std::os::raw::c_ushort,
    pub sa_data: [::std::os::raw::c_uchar; 14usize],
}
#[test]
fn bindgen_test_layout_osockaddr() {
    const UNINIT: ::std::mem::MaybeUninit<osockaddr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<osockaddr>(),
        16usize,
        concat!("Size of: ", stringify!(osockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<osockaddr>(),
        2usize,
        concat!("Alignment of ", stringify!(osockaddr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(osockaddr),
            "::",
            stringify!(sa_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_data) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(osockaddr),
            "::",
            stringify!(sa_data)
        )
    );
}
pub const SHUT_RD: _bindgen_ty_3 = 0;
pub const SHUT_WR: _bindgen_ty_3 = 1;
pub const SHUT_RDWR: _bindgen_ty_3 = 2;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
extern "C" {
    pub fn socket(
        __domain: ::std::os::raw::c_int,
        __type: ::std::os::raw::c_int,
        __protocol: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn socketpair(
        __domain: ::std::os::raw::c_int,
        __type: ::std::os::raw::c_int,
        __protocol: ::std::os::raw::c_int,
        __fds: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bind(
        __fd: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __len: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsockname(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn connect(
        __fd: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __len: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getpeername(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn send(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    pub fn recv(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    pub fn sendto(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __addr_len: socklen_t,
    ) -> isize;
}
extern "C" {
    pub fn recvfrom(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __addr_len: *mut socklen_t,
    ) -> isize;
}
extern "C" {
    pub fn sendmsg(
        __fd: ::std::os::raw::c_int,
        __message: *const msghdr,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    pub fn recvmsg(
        __fd: ::std::os::raw::c_int,
        __message: *mut msghdr,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    pub fn getsockopt(
        __fd: ::std::os::raw::c_int,
        __level: ::std::os::raw::c_int,
        __optname: ::std::os::raw::c_int,
        __optval: *mut ::std::os::raw::c_void,
        __optlen: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setsockopt(
        __fd: ::std::os::raw::c_int,
        __level: ::std::os::raw::c_int,
        __optname: ::std::os::raw::c_int,
        __optval: *const ::std::os::raw::c_void,
        __optlen: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn listen(__fd: ::std::os::raw::c_int, __n: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn accept(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __addr_len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn shutdown(
        __fd: ::std::os::raw::c_int,
        __how: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sockatmark(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isfdtype(
        __fd: ::std::os::raw::c_int,
        __fdtype: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type curl_socklen_t = socklen_t;
pub type curl_off_t = ::std::os::raw::c_long;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wch) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wchb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    const UNINIT: ::std::mem::MaybeUninit<_G_fpos_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    const UNINIT: ::std::mem::MaybeUninit<_G_fpos64_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    const UNINIT: ::std::mem::MaybeUninit<_IO_FILE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_end) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_base) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_base) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_ptr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_end) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_base) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_end) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_base) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_backup_base) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_end) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._markers) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._chain) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._fileno) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags2) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._old_offset) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._cur_column) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._vtable_offset) as usize - ptr as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._shortbuf) as usize - ptr as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._lock) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._codecvt) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wide_data) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._freeres_list) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._freeres_buf) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad5) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mode) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._unused2) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
pub type cookie_read_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *mut ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type cookie_write_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *const ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type cookie_seek_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __pos: *mut __off64_t,
        __w: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type cookie_close_function_t = ::std::option::Option<
    unsafe extern "C" fn(__cookie: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_cookie_io_functions_t {
    pub read: cookie_read_function_t,
    pub write: cookie_write_function_t,
    pub seek: cookie_seek_function_t,
    pub close: cookie_close_function_t,
}
#[test]
fn bindgen_test_layout__IO_cookie_io_functions_t() {
    const UNINIT: ::std::mem::MaybeUninit<_IO_cookie_io_functions_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_IO_cookie_io_functions_t>(),
        32usize,
        concat!("Size of: ", stringify!(_IO_cookie_io_functions_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_cookie_io_functions_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_cookie_io_functions_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).read) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).write) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seek) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(seek)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).close) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(close)
        )
    );
}
pub type cookie_io_functions_t = _IO_cookie_io_functions_t;
pub type va_list = __gnuc_va_list;
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn fopencookie(
        __magic_cookie: *mut ::std::os::raw::c_void,
        __modes: *const ::std::os::raw::c_char,
        __io_funcs: cookie_io_functions_t,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vasprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __f: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __asprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn asprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    const UNINIT: ::std::mem::MaybeUninit<tm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tm>(),
        56usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::std::mem::align_of::<tm>(),
        8usize,
        concat!("Alignment of ", stringify!(tm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_min) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_hour) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_hour)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mday) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mon) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_year) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_year)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_wday) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_wday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_yday) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_yday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_isdst) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_isdst)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_gmtoff) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_gmtoff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_zone) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_zone)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    const UNINIT: ::std::mem::MaybeUninit<itimerspec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<itimerspec>(),
        32usize,
        concat!("Size of: ", stringify!(itimerspec))
    );
    assert_eq!(
        ::std::mem::align_of::<itimerspec>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerspec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).it_interval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).it_value) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigevent {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    const UNINIT: ::std::mem::MaybeUninit<__locale_struct> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__locales) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_b) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_tolower) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_toupper) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__names) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn clock() -> clock_t;
}
extern "C" {
    pub fn time(__timer: *mut time_t) -> time_t;
}
extern "C" {
    pub fn difftime(__time1: time_t, __time0: time_t) -> f64;
}
extern "C" {
    pub fn mktime(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn strftime(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: usize,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
    ) -> usize;
}
extern "C" {
    pub fn strftime_l(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: usize,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
        __loc: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn gmtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn localtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn gmtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn localtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn asctime(__tp: *const tm) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime(__timer: *const time_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn asctime_r(
        __tp: *const tm,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime_r(
        __timer: *const time_t,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub static mut __tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    pub static mut __daylight: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut __timezone: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    pub fn tzset();
}
extern "C" {
    pub static mut daylight: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut timezone: ::std::os::raw::c_long;
}
extern "C" {
    pub fn timegm(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn timelocal(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn dysize(__year: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nanosleep(
        __requested_time: *const timespec,
        __remaining: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_nanosleep(
        __clock_id: clockid_t,
        __flags: ::std::os::raw::c_int,
        __req: *const timespec,
        __rem: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getcpuclockid(__pid: pid_t, __clock_id: *mut clockid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_create(
        __clock_id: clockid_t,
        __evp: *mut sigevent,
        __timerid: *mut timer_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_delete(__timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_settime(
        __timerid: timer_t,
        __flags: ::std::os::raw::c_int,
        __value: *const itimerspec,
        __ovalue: *mut itimerspec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_gettime(__timerid: timer_t, __value: *mut itimerspec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_getoverrun(__timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timespec_get(
        __ts: *mut timespec,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timezone {
    pub tz_minuteswest: ::std::os::raw::c_int,
    pub tz_dsttime: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_timezone() {
    const UNINIT: ::std::mem::MaybeUninit<timezone> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timezone>(),
        8usize,
        concat!("Size of: ", stringify!(timezone))
    );
    assert_eq!(
        ::std::mem::align_of::<timezone>(),
        4usize,
        concat!("Alignment of ", stringify!(timezone))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tz_minuteswest) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timezone),
            "::",
            stringify!(tz_minuteswest)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tz_dsttime) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(timezone),
            "::",
            stringify!(tz_dsttime)
        )
    );
}
extern "C" {
    pub fn gettimeofday(
        __tv: *mut timeval,
        __tz: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn settimeofday(__tv: *const timeval, __tz: *const timezone) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn adjtime(__delta: *const timeval, __olddelta: *mut timeval) -> ::std::os::raw::c_int;
}
pub const __itimer_which_ITIMER_REAL: __itimer_which = 0;
pub const __itimer_which_ITIMER_VIRTUAL: __itimer_which = 1;
pub const __itimer_which_ITIMER_PROF: __itimer_which = 2;
pub type __itimer_which = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerval {
    pub it_interval: timeval,
    pub it_value: timeval,
}
#[test]
fn bindgen_test_layout_itimerval() {
    const UNINIT: ::std::mem::MaybeUninit<itimerval> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<itimerval>(),
        32usize,
        concat!("Size of: ", stringify!(itimerval))
    );
    assert_eq!(
        ::std::mem::align_of::<itimerval>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerval))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).it_interval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerval),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).it_value) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerval),
            "::",
            stringify!(it_value)
        )
    );
}
pub type __itimer_which_t = ::std::os::raw::c_int;
extern "C" {
    pub fn getitimer(__which: __itimer_which_t, __value: *mut itimerval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setitimer(
        __which: __itimer_which_t,
        __new: *const itimerval,
        __old: *mut itimerval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn utimes(
        __file: *const ::std::os::raw::c_char,
        __tvp: *const timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lutimes(
        __file: *const ::std::os::raw::c_char,
        __tvp: *const timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn futimes(__fd: ::std::os::raw::c_int, __tvp: *const timeval) -> ::std::os::raw::c_int;
}
pub type CURL = ::std::os::raw::c_void;
pub type CURLSH = ::std::os::raw::c_void;
pub type curl_socket_t = ::std::os::raw::c_int;
pub const curl_sslbackend_CURLSSLBACKEND_NONE: curl_sslbackend = 0;
pub const curl_sslbackend_CURLSSLBACKEND_OPENSSL: curl_sslbackend = 1;
pub const curl_sslbackend_CURLSSLBACKEND_GNUTLS: curl_sslbackend = 2;
pub const curl_sslbackend_CURLSSLBACKEND_NSS: curl_sslbackend = 3;
pub const curl_sslbackend_CURLSSLBACKEND_OBSOLETE4: curl_sslbackend = 4;
pub const curl_sslbackend_CURLSSLBACKEND_GSKIT: curl_sslbackend = 5;
pub const curl_sslbackend_CURLSSLBACKEND_POLARSSL: curl_sslbackend = 6;
pub const curl_sslbackend_CURLSSLBACKEND_WOLFSSL: curl_sslbackend = 7;
pub const curl_sslbackend_CURLSSLBACKEND_SCHANNEL: curl_sslbackend = 8;
pub const curl_sslbackend_CURLSSLBACKEND_SECURETRANSPORT: curl_sslbackend = 9;
pub const curl_sslbackend_CURLSSLBACKEND_AXTLS: curl_sslbackend = 10;
pub const curl_sslbackend_CURLSSLBACKEND_MBEDTLS: curl_sslbackend = 11;
pub const curl_sslbackend_CURLSSLBACKEND_MESALINK: curl_sslbackend = 12;
pub const curl_sslbackend_CURLSSLBACKEND_BEARSSL: curl_sslbackend = 13;
pub const curl_sslbackend_CURLSSLBACKEND_RUSTLS: curl_sslbackend = 14;
pub type curl_sslbackend = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct curl_httppost {
    pub next: *mut curl_httppost,
    pub name: *mut ::std::os::raw::c_char,
    pub namelength: ::std::os::raw::c_long,
    pub contents: *mut ::std::os::raw::c_char,
    pub contentslength: ::std::os::raw::c_long,
    pub buffer: *mut ::std::os::raw::c_char,
    pub bufferlength: ::std::os::raw::c_long,
    pub contenttype: *mut ::std::os::raw::c_char,
    pub contentheader: *mut curl_slist,
    pub more: *mut curl_httppost,
    pub flags: ::std::os::raw::c_long,
    pub showfilename: *mut ::std::os::raw::c_char,
    pub userp: *mut ::std::os::raw::c_void,
    pub contentlen: curl_off_t,
}
#[test]
fn bindgen_test_layout_curl_httppost() {
    const UNINIT: ::std::mem::MaybeUninit<curl_httppost> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<curl_httppost>(),
        112usize,
        concat!("Size of: ", stringify!(curl_httppost))
    );
    assert_eq!(
        ::std::mem::align_of::<curl_httppost>(),
        8usize,
        concat!("Alignment of ", stringify!(curl_httppost))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_httppost),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_httppost),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).namelength) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_httppost),
            "::",
            stringify!(namelength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).contents) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_httppost),
            "::",
            stringify!(contents)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).contentslength) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_httppost),
            "::",
            stringify!(contentslength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_httppost),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bufferlength) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_httppost),
            "::",
            stringify!(bufferlength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).contenttype) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_httppost),
            "::",
            stringify!(contenttype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).contentheader) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_httppost),
            "::",
            stringify!(contentheader)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).more) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_httppost),
            "::",
            stringify!(more)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_httppost),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).showfilename) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_httppost),
            "::",
            stringify!(showfilename)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).userp) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_httppost),
            "::",
            stringify!(userp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).contentlen) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_httppost),
            "::",
            stringify!(contentlen)
        )
    );
}
pub type curl_progress_callback = ::std::option::Option<
    unsafe extern "C" fn(
        clientp: *mut ::std::os::raw::c_void,
        dltotal: f64,
        dlnow: f64,
        ultotal: f64,
        ulnow: f64,
    ) -> ::std::os::raw::c_int,
>;
pub type curl_xferinfo_callback = ::std::option::Option<
    unsafe extern "C" fn(
        clientp: *mut ::std::os::raw::c_void,
        dltotal: curl_off_t,
        dlnow: curl_off_t,
        ultotal: curl_off_t,
        ulnow: curl_off_t,
    ) -> ::std::os::raw::c_int,
>;
pub type curl_write_callback = ::std::option::Option<
    unsafe extern "C" fn(
        buffer: *mut ::std::os::raw::c_char,
        size: usize,
        nitems: usize,
        outstream: *mut ::std::os::raw::c_void,
    ) -> usize,
>;
pub type curl_resolver_start_callback = ::std::option::Option<
    unsafe extern "C" fn(
        resolver_state: *mut ::std::os::raw::c_void,
        reserved: *mut ::std::os::raw::c_void,
        userdata: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub const curlfiletype_CURLFILETYPE_FILE: curlfiletype = 0;
pub const curlfiletype_CURLFILETYPE_DIRECTORY: curlfiletype = 1;
pub const curlfiletype_CURLFILETYPE_SYMLINK: curlfiletype = 2;
pub const curlfiletype_CURLFILETYPE_DEVICE_BLOCK: curlfiletype = 3;
pub const curlfiletype_CURLFILETYPE_DEVICE_CHAR: curlfiletype = 4;
pub const curlfiletype_CURLFILETYPE_NAMEDPIPE: curlfiletype = 5;
pub const curlfiletype_CURLFILETYPE_SOCKET: curlfiletype = 6;
pub const curlfiletype_CURLFILETYPE_DOOR: curlfiletype = 7;
pub const curlfiletype_CURLFILETYPE_UNKNOWN: curlfiletype = 8;
pub type curlfiletype = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct curl_fileinfo {
    pub filename: *mut ::std::os::raw::c_char,
    pub filetype: curlfiletype,
    pub time: time_t,
    pub perm: ::std::os::raw::c_uint,
    pub uid: ::std::os::raw::c_int,
    pub gid: ::std::os::raw::c_int,
    pub size: curl_off_t,
    pub hardlinks: ::std::os::raw::c_long,
    pub strings: curl_fileinfo__bindgen_ty_1,
    pub flags: ::std::os::raw::c_uint,
    pub b_data: *mut ::std::os::raw::c_char,
    pub b_size: usize,
    pub b_used: usize,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct curl_fileinfo__bindgen_ty_1 {
    pub time: *mut ::std::os::raw::c_char,
    pub perm: *mut ::std::os::raw::c_char,
    pub user: *mut ::std::os::raw::c_char,
    pub group: *mut ::std::os::raw::c_char,
    pub target: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_curl_fileinfo__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<curl_fileinfo__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<curl_fileinfo__bindgen_ty_1>(),
        40usize,
        concat!("Size of: ", stringify!(curl_fileinfo__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<curl_fileinfo__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(curl_fileinfo__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_fileinfo__bindgen_ty_1),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).perm) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_fileinfo__bindgen_ty_1),
            "::",
            stringify!(perm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_fileinfo__bindgen_ty_1),
            "::",
            stringify!(user)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).group) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_fileinfo__bindgen_ty_1),
            "::",
            stringify!(group)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_fileinfo__bindgen_ty_1),
            "::",
            stringify!(target)
        )
    );
}
#[test]
fn bindgen_test_layout_curl_fileinfo() {
    const UNINIT: ::std::mem::MaybeUninit<curl_fileinfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<curl_fileinfo>(),
        128usize,
        concat!("Size of: ", stringify!(curl_fileinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<curl_fileinfo>(),
        8usize,
        concat!("Alignment of ", stringify!(curl_fileinfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).filename) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_fileinfo),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).filetype) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_fileinfo),
            "::",
            stringify!(filetype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_fileinfo),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).perm) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_fileinfo),
            "::",
            stringify!(perm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uid) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_fileinfo),
            "::",
            stringify!(uid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gid) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_fileinfo),
            "::",
            stringify!(gid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_fileinfo),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hardlinks) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_fileinfo),
            "::",
            stringify!(hardlinks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).strings) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_fileinfo),
            "::",
            stringify!(strings)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_fileinfo),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b_data) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_fileinfo),
            "::",
            stringify!(b_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b_size) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_fileinfo),
            "::",
            stringify!(b_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b_used) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_fileinfo),
            "::",
            stringify!(b_used)
        )
    );
}
pub type curl_chunk_bgn_callback = ::std::option::Option<
    unsafe extern "C" fn(
        transfer_info: *const ::std::os::raw::c_void,
        ptr: *mut ::std::os::raw::c_void,
        remains: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long,
>;
pub type curl_chunk_end_callback = ::std::option::Option<
    unsafe extern "C" fn(ptr: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_long,
>;
pub type curl_fnmatch_callback = ::std::option::Option<
    unsafe extern "C" fn(
        ptr: *mut ::std::os::raw::c_void,
        pattern: *const ::std::os::raw::c_char,
        string: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
pub type curl_seek_callback = ::std::option::Option<
    unsafe extern "C" fn(
        instream: *mut ::std::os::raw::c_void,
        offset: curl_off_t,
        origin: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type curl_read_callback = ::std::option::Option<
    unsafe extern "C" fn(
        buffer: *mut ::std::os::raw::c_char,
        size: usize,
        nitems: usize,
        instream: *mut ::std::os::raw::c_void,
    ) -> usize,
>;
pub type curl_trailer_callback = ::std::option::Option<
    unsafe extern "C" fn(
        list: *mut *mut curl_slist,
        userdata: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub const curlsocktype_CURLSOCKTYPE_IPCXN: curlsocktype = 0;
pub const curlsocktype_CURLSOCKTYPE_ACCEPT: curlsocktype = 1;
pub const curlsocktype_CURLSOCKTYPE_LAST: curlsocktype = 2;
pub type curlsocktype = ::std::os::raw::c_uint;
pub type curl_sockopt_callback = ::std::option::Option<
    unsafe extern "C" fn(
        clientp: *mut ::std::os::raw::c_void,
        curlfd: curl_socket_t,
        purpose: curlsocktype,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct curl_sockaddr {
    pub family: ::std::os::raw::c_int,
    pub socktype: ::std::os::raw::c_int,
    pub protocol: ::std::os::raw::c_int,
    pub addrlen: ::std::os::raw::c_uint,
    pub addr: sockaddr,
}
#[test]
fn bindgen_test_layout_curl_sockaddr() {
    const UNINIT: ::std::mem::MaybeUninit<curl_sockaddr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<curl_sockaddr>(),
        32usize,
        concat!("Size of: ", stringify!(curl_sockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<curl_sockaddr>(),
        4usize,
        concat!("Alignment of ", stringify!(curl_sockaddr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_sockaddr),
            "::",
            stringify!(family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).socktype) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_sockaddr),
            "::",
            stringify!(socktype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).protocol) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_sockaddr),
            "::",
            stringify!(protocol)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addrlen) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_sockaddr),
            "::",
            stringify!(addrlen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_sockaddr),
            "::",
            stringify!(addr)
        )
    );
}
pub type curl_opensocket_callback = ::std::option::Option<
    unsafe extern "C" fn(
        clientp: *mut ::std::os::raw::c_void,
        purpose: curlsocktype,
        address: *mut curl_sockaddr,
    ) -> curl_socket_t,
>;
pub type curl_closesocket_callback = ::std::option::Option<
    unsafe extern "C" fn(
        clientp: *mut ::std::os::raw::c_void,
        item: curl_socket_t,
    ) -> ::std::os::raw::c_int,
>;
pub const curlioerr_CURLIOE_OK: curlioerr = 0;
pub const curlioerr_CURLIOE_UNKNOWNCMD: curlioerr = 1;
pub const curlioerr_CURLIOE_FAILRESTART: curlioerr = 2;
pub const curlioerr_CURLIOE_LAST: curlioerr = 3;
pub type curlioerr = ::std::os::raw::c_uint;
pub const curliocmd_CURLIOCMD_NOP: curliocmd = 0;
pub const curliocmd_CURLIOCMD_RESTARTREAD: curliocmd = 1;
pub const curliocmd_CURLIOCMD_LAST: curliocmd = 2;
pub type curliocmd = ::std::os::raw::c_uint;
pub type curl_ioctl_callback = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *mut CURL,
        cmd: ::std::os::raw::c_int,
        clientp: *mut ::std::os::raw::c_void,
    ) -> curlioerr,
>;
pub type curl_malloc_callback =
    ::std::option::Option<unsafe extern "C" fn(size: usize) -> *mut ::std::os::raw::c_void>;
pub type curl_free_callback =
    ::std::option::Option<unsafe extern "C" fn(ptr: *mut ::std::os::raw::c_void)>;
pub type curl_realloc_callback = ::std::option::Option<
    unsafe extern "C" fn(
        ptr: *mut ::std::os::raw::c_void,
        size: usize,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type curl_strdup_callback = ::std::option::Option<
    unsafe extern "C" fn(str_: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char,
>;
pub type curl_calloc_callback = ::std::option::Option<
    unsafe extern "C" fn(nmemb: usize, size: usize) -> *mut ::std::os::raw::c_void,
>;
pub const curl_infotype_CURLINFO_TEXT: curl_infotype = 0;
pub const curl_infotype_CURLINFO_HEADER_IN: curl_infotype = 1;
pub const curl_infotype_CURLINFO_HEADER_OUT: curl_infotype = 2;
pub const curl_infotype_CURLINFO_DATA_IN: curl_infotype = 3;
pub const curl_infotype_CURLINFO_DATA_OUT: curl_infotype = 4;
pub const curl_infotype_CURLINFO_SSL_DATA_IN: curl_infotype = 5;
pub const curl_infotype_CURLINFO_SSL_DATA_OUT: curl_infotype = 6;
pub const curl_infotype_CURLINFO_END: curl_infotype = 7;
pub type curl_infotype = ::std::os::raw::c_uint;
pub type curl_debug_callback = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *mut CURL,
        type_: curl_infotype,
        data: *mut ::std::os::raw::c_char,
        size: usize,
        userptr: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type curl_prereq_callback = ::std::option::Option<
    unsafe extern "C" fn(
        clientp: *mut ::std::os::raw::c_void,
        conn_primary_ip: *mut ::std::os::raw::c_char,
        conn_local_ip: *mut ::std::os::raw::c_char,
        conn_primary_port: ::std::os::raw::c_int,
        conn_local_port: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub const CURLcode_CURLE_OK: CURLcode = 0;
pub const CURLcode_CURLE_UNSUPPORTED_PROTOCOL: CURLcode = 1;
pub const CURLcode_CURLE_FAILED_INIT: CURLcode = 2;
pub const CURLcode_CURLE_URL_MALFORMAT: CURLcode = 3;
pub const CURLcode_CURLE_NOT_BUILT_IN: CURLcode = 4;
pub const CURLcode_CURLE_COULDNT_RESOLVE_PROXY: CURLcode = 5;
pub const CURLcode_CURLE_COULDNT_RESOLVE_HOST: CURLcode = 6;
pub const CURLcode_CURLE_COULDNT_CONNECT: CURLcode = 7;
pub const CURLcode_CURLE_WEIRD_SERVER_REPLY: CURLcode = 8;
pub const CURLcode_CURLE_REMOTE_ACCESS_DENIED: CURLcode = 9;
pub const CURLcode_CURLE_FTP_ACCEPT_FAILED: CURLcode = 10;
pub const CURLcode_CURLE_FTP_WEIRD_PASS_REPLY: CURLcode = 11;
pub const CURLcode_CURLE_FTP_ACCEPT_TIMEOUT: CURLcode = 12;
pub const CURLcode_CURLE_FTP_WEIRD_PASV_REPLY: CURLcode = 13;
pub const CURLcode_CURLE_FTP_WEIRD_227_FORMAT: CURLcode = 14;
pub const CURLcode_CURLE_FTP_CANT_GET_HOST: CURLcode = 15;
pub const CURLcode_CURLE_HTTP2: CURLcode = 16;
pub const CURLcode_CURLE_FTP_COULDNT_SET_TYPE: CURLcode = 17;
pub const CURLcode_CURLE_PARTIAL_FILE: CURLcode = 18;
pub const CURLcode_CURLE_FTP_COULDNT_RETR_FILE: CURLcode = 19;
pub const CURLcode_CURLE_OBSOLETE20: CURLcode = 20;
pub const CURLcode_CURLE_QUOTE_ERROR: CURLcode = 21;
pub const CURLcode_CURLE_HTTP_RETURNED_ERROR: CURLcode = 22;
pub const CURLcode_CURLE_WRITE_ERROR: CURLcode = 23;
pub const CURLcode_CURLE_OBSOLETE24: CURLcode = 24;
pub const CURLcode_CURLE_UPLOAD_FAILED: CURLcode = 25;
pub const CURLcode_CURLE_READ_ERROR: CURLcode = 26;
pub const CURLcode_CURLE_OUT_OF_MEMORY: CURLcode = 27;
pub const CURLcode_CURLE_OPERATION_TIMEDOUT: CURLcode = 28;
pub const CURLcode_CURLE_OBSOLETE29: CURLcode = 29;
pub const CURLcode_CURLE_FTP_PORT_FAILED: CURLcode = 30;
pub const CURLcode_CURLE_FTP_COULDNT_USE_REST: CURLcode = 31;
pub const CURLcode_CURLE_OBSOLETE32: CURLcode = 32;
pub const CURLcode_CURLE_RANGE_ERROR: CURLcode = 33;
pub const CURLcode_CURLE_OBSOLETE34: CURLcode = 34;
pub const CURLcode_CURLE_SSL_CONNECT_ERROR: CURLcode = 35;
pub const CURLcode_CURLE_BAD_DOWNLOAD_RESUME: CURLcode = 36;
pub const CURLcode_CURLE_FILE_COULDNT_READ_FILE: CURLcode = 37;
pub const CURLcode_CURLE_LDAP_CANNOT_BIND: CURLcode = 38;
pub const CURLcode_CURLE_LDAP_SEARCH_FAILED: CURLcode = 39;
pub const CURLcode_CURLE_OBSOLETE40: CURLcode = 40;
pub const CURLcode_CURLE_OBSOLETE41: CURLcode = 41;
pub const CURLcode_CURLE_ABORTED_BY_CALLBACK: CURLcode = 42;
pub const CURLcode_CURLE_BAD_FUNCTION_ARGUMENT: CURLcode = 43;
pub const CURLcode_CURLE_OBSOLETE44: CURLcode = 44;
pub const CURLcode_CURLE_INTERFACE_FAILED: CURLcode = 45;
pub const CURLcode_CURLE_OBSOLETE46: CURLcode = 46;
pub const CURLcode_CURLE_TOO_MANY_REDIRECTS: CURLcode = 47;
pub const CURLcode_CURLE_UNKNOWN_OPTION: CURLcode = 48;
pub const CURLcode_CURLE_SETOPT_OPTION_SYNTAX: CURLcode = 49;
pub const CURLcode_CURLE_OBSOLETE50: CURLcode = 50;
pub const CURLcode_CURLE_OBSOLETE51: CURLcode = 51;
pub const CURLcode_CURLE_GOT_NOTHING: CURLcode = 52;
pub const CURLcode_CURLE_SSL_ENGINE_NOTFOUND: CURLcode = 53;
pub const CURLcode_CURLE_SSL_ENGINE_SETFAILED: CURLcode = 54;
pub const CURLcode_CURLE_SEND_ERROR: CURLcode = 55;
pub const CURLcode_CURLE_RECV_ERROR: CURLcode = 56;
pub const CURLcode_CURLE_OBSOLETE57: CURLcode = 57;
pub const CURLcode_CURLE_SSL_CERTPROBLEM: CURLcode = 58;
pub const CURLcode_CURLE_SSL_CIPHER: CURLcode = 59;
pub const CURLcode_CURLE_PEER_FAILED_VERIFICATION: CURLcode = 60;
pub const CURLcode_CURLE_BAD_CONTENT_ENCODING: CURLcode = 61;
pub const CURLcode_CURLE_OBSOLETE62: CURLcode = 62;
pub const CURLcode_CURLE_FILESIZE_EXCEEDED: CURLcode = 63;
pub const CURLcode_CURLE_USE_SSL_FAILED: CURLcode = 64;
pub const CURLcode_CURLE_SEND_FAIL_REWIND: CURLcode = 65;
pub const CURLcode_CURLE_SSL_ENGINE_INITFAILED: CURLcode = 66;
pub const CURLcode_CURLE_LOGIN_DENIED: CURLcode = 67;
pub const CURLcode_CURLE_TFTP_NOTFOUND: CURLcode = 68;
pub const CURLcode_CURLE_TFTP_PERM: CURLcode = 69;
pub const CURLcode_CURLE_REMOTE_DISK_FULL: CURLcode = 70;
pub const CURLcode_CURLE_TFTP_ILLEGAL: CURLcode = 71;
pub const CURLcode_CURLE_TFTP_UNKNOWNID: CURLcode = 72;
pub const CURLcode_CURLE_REMOTE_FILE_EXISTS: CURLcode = 73;
pub const CURLcode_CURLE_TFTP_NOSUCHUSER: CURLcode = 74;
pub const CURLcode_CURLE_OBSOLETE75: CURLcode = 75;
pub const CURLcode_CURLE_OBSOLETE76: CURLcode = 76;
pub const CURLcode_CURLE_SSL_CACERT_BADFILE: CURLcode = 77;
pub const CURLcode_CURLE_REMOTE_FILE_NOT_FOUND: CURLcode = 78;
pub const CURLcode_CURLE_SSH: CURLcode = 79;
pub const CURLcode_CURLE_SSL_SHUTDOWN_FAILED: CURLcode = 80;
pub const CURLcode_CURLE_AGAIN: CURLcode = 81;
pub const CURLcode_CURLE_SSL_CRL_BADFILE: CURLcode = 82;
pub const CURLcode_CURLE_SSL_ISSUER_ERROR: CURLcode = 83;
pub const CURLcode_CURLE_FTP_PRET_FAILED: CURLcode = 84;
pub const CURLcode_CURLE_RTSP_CSEQ_ERROR: CURLcode = 85;
pub const CURLcode_CURLE_RTSP_SESSION_ERROR: CURLcode = 86;
pub const CURLcode_CURLE_FTP_BAD_FILE_LIST: CURLcode = 87;
pub const CURLcode_CURLE_CHUNK_FAILED: CURLcode = 88;
pub const CURLcode_CURLE_NO_CONNECTION_AVAILABLE: CURLcode = 89;
pub const CURLcode_CURLE_SSL_PINNEDPUBKEYNOTMATCH: CURLcode = 90;
pub const CURLcode_CURLE_SSL_INVALIDCERTSTATUS: CURLcode = 91;
pub const CURLcode_CURLE_HTTP2_STREAM: CURLcode = 92;
pub const CURLcode_CURLE_RECURSIVE_API_CALL: CURLcode = 93;
pub const CURLcode_CURLE_AUTH_ERROR: CURLcode = 94;
pub const CURLcode_CURLE_HTTP3: CURLcode = 95;
pub const CURLcode_CURLE_QUIC_CONNECT_ERROR: CURLcode = 96;
pub const CURLcode_CURLE_PROXY: CURLcode = 97;
pub const CURLcode_CURLE_SSL_CLIENTCERT: CURLcode = 98;
pub const CURLcode_CURLE_UNRECOVERABLE_POLL: CURLcode = 99;
pub const CURLcode_CURLE_TOO_LARGE: CURLcode = 100;
pub const CURLcode_CURLE_ECH_REQUIRED: CURLcode = 101;
pub const CURLcode_CURL_LAST: CURLcode = 102;
pub type CURLcode = ::std::os::raw::c_uint;
pub const CURLproxycode_CURLPX_OK: CURLproxycode = 0;
pub const CURLproxycode_CURLPX_BAD_ADDRESS_TYPE: CURLproxycode = 1;
pub const CURLproxycode_CURLPX_BAD_VERSION: CURLproxycode = 2;
pub const CURLproxycode_CURLPX_CLOSED: CURLproxycode = 3;
pub const CURLproxycode_CURLPX_GSSAPI: CURLproxycode = 4;
pub const CURLproxycode_CURLPX_GSSAPI_PERMSG: CURLproxycode = 5;
pub const CURLproxycode_CURLPX_GSSAPI_PROTECTION: CURLproxycode = 6;
pub const CURLproxycode_CURLPX_IDENTD: CURLproxycode = 7;
pub const CURLproxycode_CURLPX_IDENTD_DIFFER: CURLproxycode = 8;
pub const CURLproxycode_CURLPX_LONG_HOSTNAME: CURLproxycode = 9;
pub const CURLproxycode_CURLPX_LONG_PASSWD: CURLproxycode = 10;
pub const CURLproxycode_CURLPX_LONG_USER: CURLproxycode = 11;
pub const CURLproxycode_CURLPX_NO_AUTH: CURLproxycode = 12;
pub const CURLproxycode_CURLPX_RECV_ADDRESS: CURLproxycode = 13;
pub const CURLproxycode_CURLPX_RECV_AUTH: CURLproxycode = 14;
pub const CURLproxycode_CURLPX_RECV_CONNECT: CURLproxycode = 15;
pub const CURLproxycode_CURLPX_RECV_REQACK: CURLproxycode = 16;
pub const CURLproxycode_CURLPX_REPLY_ADDRESS_TYPE_NOT_SUPPORTED: CURLproxycode = 17;
pub const CURLproxycode_CURLPX_REPLY_COMMAND_NOT_SUPPORTED: CURLproxycode = 18;
pub const CURLproxycode_CURLPX_REPLY_CONNECTION_REFUSED: CURLproxycode = 19;
pub const CURLproxycode_CURLPX_REPLY_GENERAL_SERVER_FAILURE: CURLproxycode = 20;
pub const CURLproxycode_CURLPX_REPLY_HOST_UNREACHABLE: CURLproxycode = 21;
pub const CURLproxycode_CURLPX_REPLY_NETWORK_UNREACHABLE: CURLproxycode = 22;
pub const CURLproxycode_CURLPX_REPLY_NOT_ALLOWED: CURLproxycode = 23;
pub const CURLproxycode_CURLPX_REPLY_TTL_EXPIRED: CURLproxycode = 24;
pub const CURLproxycode_CURLPX_REPLY_UNASSIGNED: CURLproxycode = 25;
pub const CURLproxycode_CURLPX_REQUEST_FAILED: CURLproxycode = 26;
pub const CURLproxycode_CURLPX_RESOLVE_HOST: CURLproxycode = 27;
pub const CURLproxycode_CURLPX_SEND_AUTH: CURLproxycode = 28;
pub const CURLproxycode_CURLPX_SEND_CONNECT: CURLproxycode = 29;
pub const CURLproxycode_CURLPX_SEND_REQUEST: CURLproxycode = 30;
pub const CURLproxycode_CURLPX_UNKNOWN_FAIL: CURLproxycode = 31;
pub const CURLproxycode_CURLPX_UNKNOWN_MODE: CURLproxycode = 32;
pub const CURLproxycode_CURLPX_USER_REJECTED: CURLproxycode = 33;
pub const CURLproxycode_CURLPX_LAST: CURLproxycode = 34;
pub type CURLproxycode = ::std::os::raw::c_uint;
pub type curl_conv_callback = ::std::option::Option<
    unsafe extern "C" fn(buffer: *mut ::std::os::raw::c_char, length: usize) -> CURLcode,
>;
pub type curl_ssl_ctx_callback = ::std::option::Option<
    unsafe extern "C" fn(
        curl: *mut CURL,
        ssl_ctx: *mut ::std::os::raw::c_void,
        userptr: *mut ::std::os::raw::c_void,
    ) -> CURLcode,
>;
pub const curl_proxytype_CURLPROXY_LAST: curl_proxytype = 8;
pub type curl_proxytype = ::std::os::raw::c_uint;
pub const curl_khtype_CURLKHTYPE_UNKNOWN: curl_khtype = 0;
pub const curl_khtype_CURLKHTYPE_RSA1: curl_khtype = 1;
pub const curl_khtype_CURLKHTYPE_RSA: curl_khtype = 2;
pub const curl_khtype_CURLKHTYPE_DSS: curl_khtype = 3;
pub const curl_khtype_CURLKHTYPE_ECDSA: curl_khtype = 4;
pub const curl_khtype_CURLKHTYPE_ED25519: curl_khtype = 5;
pub type curl_khtype = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct curl_khkey {
    pub key: *const ::std::os::raw::c_char,
    pub len: usize,
    pub keytype: curl_khtype,
}
#[test]
fn bindgen_test_layout_curl_khkey() {
    const UNINIT: ::std::mem::MaybeUninit<curl_khkey> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<curl_khkey>(),
        24usize,
        concat!("Size of: ", stringify!(curl_khkey))
    );
    assert_eq!(
        ::std::mem::align_of::<curl_khkey>(),
        8usize,
        concat!("Alignment of ", stringify!(curl_khkey))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_khkey),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_khkey),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keytype) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_khkey),
            "::",
            stringify!(keytype)
        )
    );
}
pub const curl_khstat_CURLKHSTAT_FINE_ADD_TO_FILE: curl_khstat = 0;
pub const curl_khstat_CURLKHSTAT_FINE: curl_khstat = 1;
pub const curl_khstat_CURLKHSTAT_REJECT: curl_khstat = 2;
pub const curl_khstat_CURLKHSTAT_DEFER: curl_khstat = 3;
pub const curl_khstat_CURLKHSTAT_FINE_REPLACE: curl_khstat = 4;
pub const curl_khstat_CURLKHSTAT_LAST: curl_khstat = 5;
pub type curl_khstat = ::std::os::raw::c_uint;
pub const curl_khmatch_CURLKHMATCH_OK: curl_khmatch = 0;
pub const curl_khmatch_CURLKHMATCH_MISMATCH: curl_khmatch = 1;
pub const curl_khmatch_CURLKHMATCH_MISSING: curl_khmatch = 2;
pub const curl_khmatch_CURLKHMATCH_LAST: curl_khmatch = 3;
pub type curl_khmatch = ::std::os::raw::c_uint;
pub type curl_sshkeycallback = ::std::option::Option<
    unsafe extern "C" fn(
        easy: *mut CURL,
        knownkey: *const curl_khkey,
        foundkey: *const curl_khkey,
        arg1: curl_khmatch,
        clientp: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type curl_sshhostkeycallback = ::std::option::Option<
    unsafe extern "C" fn(
        clientp: *mut ::std::os::raw::c_void,
        keytype: ::std::os::raw::c_int,
        key: *const ::std::os::raw::c_char,
        keylen: usize,
    ) -> ::std::os::raw::c_int,
>;
pub const curl_usessl_CURLUSESSL_LAST: curl_usessl = 4;
pub type curl_usessl = ::std::os::raw::c_uint;
pub const curl_ftpccc_CURLFTPSSL_CCC_LAST: curl_ftpccc = 3;
pub type curl_ftpccc = ::std::os::raw::c_uint;
pub const curl_ftpauth_CURLFTPAUTH_LAST: curl_ftpauth = 3;
pub type curl_ftpauth = ::std::os::raw::c_uint;
pub const curl_ftpcreatedir_CURLFTP_CREATE_DIR_LAST: curl_ftpcreatedir = 3;
pub type curl_ftpcreatedir = ::std::os::raw::c_uint;
pub const curl_ftpmethod_CURLFTPMETHOD_LAST: curl_ftpmethod = 4;
pub type curl_ftpmethod = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct curl_hstsentry {
    pub name: *mut ::std::os::raw::c_char,
    pub namelen: usize,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub expire: [::std::os::raw::c_char; 18usize],
}
#[test]
fn bindgen_test_layout_curl_hstsentry() {
    const UNINIT: ::std::mem::MaybeUninit<curl_hstsentry> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<curl_hstsentry>(),
        40usize,
        concat!("Size of: ", stringify!(curl_hstsentry))
    );
    assert_eq!(
        ::std::mem::align_of::<curl_hstsentry>(),
        8usize,
        concat!("Alignment of ", stringify!(curl_hstsentry))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_hstsentry),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).namelen) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_hstsentry),
            "::",
            stringify!(namelen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).expire) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_hstsentry),
            "::",
            stringify!(expire)
        )
    );
}
impl curl_hstsentry {
    #[inline]
    pub fn includeSubDomains(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_includeSubDomains(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        includeSubDomains: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let includeSubDomains: u32 = unsafe { ::std::mem::transmute(includeSubDomains) };
            includeSubDomains as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct curl_index {
    pub index: usize,
    pub total: usize,
}
#[test]
fn bindgen_test_layout_curl_index() {
    const UNINIT: ::std::mem::MaybeUninit<curl_index> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<curl_index>(),
        16usize,
        concat!("Size of: ", stringify!(curl_index))
    );
    assert_eq!(
        ::std::mem::align_of::<curl_index>(),
        8usize,
        concat!("Alignment of ", stringify!(curl_index))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_index),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_index),
            "::",
            stringify!(total)
        )
    );
}
pub const CURLSTScode_CURLSTS_OK: CURLSTScode = 0;
pub const CURLSTScode_CURLSTS_DONE: CURLSTScode = 1;
pub const CURLSTScode_CURLSTS_FAIL: CURLSTScode = 2;
pub type CURLSTScode = ::std::os::raw::c_uint;
pub type curl_hstsread_callback = ::std::option::Option<
    unsafe extern "C" fn(
        easy: *mut CURL,
        e: *mut curl_hstsentry,
        userp: *mut ::std::os::raw::c_void,
    ) -> CURLSTScode,
>;
pub type curl_hstswrite_callback = ::std::option::Option<
    unsafe extern "C" fn(
        easy: *mut CURL,
        e: *mut curl_hstsentry,
        i: *mut curl_index,
        userp: *mut ::std::os::raw::c_void,
    ) -> CURLSTScode,
>;
pub const CURLoption_CURLOPT_WRITEDATA: CURLoption = 10001;
pub const CURLoption_CURLOPT_URL: CURLoption = 10002;
pub const CURLoption_CURLOPT_PORT: CURLoption = 3;
pub const CURLoption_CURLOPT_PROXY: CURLoption = 10004;
pub const CURLoption_CURLOPT_USERPWD: CURLoption = 10005;
pub const CURLoption_CURLOPT_PROXYUSERPWD: CURLoption = 10006;
pub const CURLoption_CURLOPT_RANGE: CURLoption = 10007;
pub const CURLoption_CURLOPT_READDATA: CURLoption = 10009;
pub const CURLoption_CURLOPT_ERRORBUFFER: CURLoption = 10010;
pub const CURLoption_CURLOPT_WRITEFUNCTION: CURLoption = 20011;
pub const CURLoption_CURLOPT_READFUNCTION: CURLoption = 20012;
pub const CURLoption_CURLOPT_TIMEOUT: CURLoption = 13;
pub const CURLoption_CURLOPT_INFILESIZE: CURLoption = 14;
pub const CURLoption_CURLOPT_POSTFIELDS: CURLoption = 10015;
pub const CURLoption_CURLOPT_REFERER: CURLoption = 10016;
pub const CURLoption_CURLOPT_FTPPORT: CURLoption = 10017;
pub const CURLoption_CURLOPT_USERAGENT: CURLoption = 10018;
pub const CURLoption_CURLOPT_LOW_SPEED_LIMIT: CURLoption = 19;
pub const CURLoption_CURLOPT_LOW_SPEED_TIME: CURLoption = 20;
pub const CURLoption_CURLOPT_RESUME_FROM: CURLoption = 21;
pub const CURLoption_CURLOPT_COOKIE: CURLoption = 10022;
pub const CURLoption_CURLOPT_HTTPHEADER: CURLoption = 10023;
pub const CURLoption_CURLOPT_HTTPPOST: CURLoption = 10024;
pub const CURLoption_CURLOPT_SSLCERT: CURLoption = 10025;
pub const CURLoption_CURLOPT_KEYPASSWD: CURLoption = 10026;
pub const CURLoption_CURLOPT_CRLF: CURLoption = 27;
pub const CURLoption_CURLOPT_QUOTE: CURLoption = 10028;
pub const CURLoption_CURLOPT_HEADERDATA: CURLoption = 10029;
pub const CURLoption_CURLOPT_COOKIEFILE: CURLoption = 10031;
pub const CURLoption_CURLOPT_SSLVERSION: CURLoption = 32;
pub const CURLoption_CURLOPT_TIMECONDITION: CURLoption = 33;
pub const CURLoption_CURLOPT_TIMEVALUE: CURLoption = 34;
pub const CURLoption_CURLOPT_CUSTOMREQUEST: CURLoption = 10036;
pub const CURLoption_CURLOPT_STDERR: CURLoption = 10037;
pub const CURLoption_CURLOPT_POSTQUOTE: CURLoption = 10039;
pub const CURLoption_CURLOPT_VERBOSE: CURLoption = 41;
pub const CURLoption_CURLOPT_HEADER: CURLoption = 42;
pub const CURLoption_CURLOPT_NOPROGRESS: CURLoption = 43;
pub const CURLoption_CURLOPT_NOBODY: CURLoption = 44;
pub const CURLoption_CURLOPT_FAILONERROR: CURLoption = 45;
pub const CURLoption_CURLOPT_UPLOAD: CURLoption = 46;
pub const CURLoption_CURLOPT_POST: CURLoption = 47;
pub const CURLoption_CURLOPT_DIRLISTONLY: CURLoption = 48;
pub const CURLoption_CURLOPT_APPEND: CURLoption = 50;
pub const CURLoption_CURLOPT_NETRC: CURLoption = 51;
pub const CURLoption_CURLOPT_FOLLOWLOCATION: CURLoption = 52;
pub const CURLoption_CURLOPT_TRANSFERTEXT: CURLoption = 53;
pub const CURLoption_CURLOPT_PUT: CURLoption = 54;
pub const CURLoption_CURLOPT_PROGRESSFUNCTION: CURLoption = 20056;
pub const CURLoption_CURLOPT_XFERINFODATA: CURLoption = 10057;
pub const CURLoption_CURLOPT_AUTOREFERER: CURLoption = 58;
pub const CURLoption_CURLOPT_PROXYPORT: CURLoption = 59;
pub const CURLoption_CURLOPT_POSTFIELDSIZE: CURLoption = 60;
pub const CURLoption_CURLOPT_HTTPPROXYTUNNEL: CURLoption = 61;
pub const CURLoption_CURLOPT_INTERFACE: CURLoption = 10062;
pub const CURLoption_CURLOPT_KRBLEVEL: CURLoption = 10063;
pub const CURLoption_CURLOPT_SSL_VERIFYPEER: CURLoption = 64;
pub const CURLoption_CURLOPT_CAINFO: CURLoption = 10065;
pub const CURLoption_CURLOPT_MAXREDIRS: CURLoption = 68;
pub const CURLoption_CURLOPT_FILETIME: CURLoption = 69;
pub const CURLoption_CURLOPT_TELNETOPTIONS: CURLoption = 10070;
pub const CURLoption_CURLOPT_MAXCONNECTS: CURLoption = 71;
pub const CURLoption_CURLOPT_FRESH_CONNECT: CURLoption = 74;
pub const CURLoption_CURLOPT_FORBID_REUSE: CURLoption = 75;
pub const CURLoption_CURLOPT_RANDOM_FILE: CURLoption = 10076;
pub const CURLoption_CURLOPT_EGDSOCKET: CURLoption = 10077;
pub const CURLoption_CURLOPT_CONNECTTIMEOUT: CURLoption = 78;
pub const CURLoption_CURLOPT_HEADERFUNCTION: CURLoption = 20079;
pub const CURLoption_CURLOPT_HTTPGET: CURLoption = 80;
pub const CURLoption_CURLOPT_SSL_VERIFYHOST: CURLoption = 81;
pub const CURLoption_CURLOPT_COOKIEJAR: CURLoption = 10082;
pub const CURLoption_CURLOPT_SSL_CIPHER_LIST: CURLoption = 10083;
pub const CURLoption_CURLOPT_HTTP_VERSION: CURLoption = 84;
pub const CURLoption_CURLOPT_FTP_USE_EPSV: CURLoption = 85;
pub const CURLoption_CURLOPT_SSLCERTTYPE: CURLoption = 10086;
pub const CURLoption_CURLOPT_SSLKEY: CURLoption = 10087;
pub const CURLoption_CURLOPT_SSLKEYTYPE: CURLoption = 10088;
pub const CURLoption_CURLOPT_SSLENGINE: CURLoption = 10089;
pub const CURLoption_CURLOPT_SSLENGINE_DEFAULT: CURLoption = 90;
pub const CURLoption_CURLOPT_DNS_USE_GLOBAL_CACHE: CURLoption = 91;
pub const CURLoption_CURLOPT_DNS_CACHE_TIMEOUT: CURLoption = 92;
pub const CURLoption_CURLOPT_PREQUOTE: CURLoption = 10093;
pub const CURLoption_CURLOPT_DEBUGFUNCTION: CURLoption = 20094;
pub const CURLoption_CURLOPT_DEBUGDATA: CURLoption = 10095;
pub const CURLoption_CURLOPT_COOKIESESSION: CURLoption = 96;
pub const CURLoption_CURLOPT_CAPATH: CURLoption = 10097;
pub const CURLoption_CURLOPT_BUFFERSIZE: CURLoption = 98;
pub const CURLoption_CURLOPT_NOSIGNAL: CURLoption = 99;
pub const CURLoption_CURLOPT_SHARE: CURLoption = 10100;
pub const CURLoption_CURLOPT_PROXYTYPE: CURLoption = 101;
pub const CURLoption_CURLOPT_ACCEPT_ENCODING: CURLoption = 10102;
pub const CURLoption_CURLOPT_PRIVATE: CURLoption = 10103;
pub const CURLoption_CURLOPT_HTTP200ALIASES: CURLoption = 10104;
pub const CURLoption_CURLOPT_UNRESTRICTED_AUTH: CURLoption = 105;
pub const CURLoption_CURLOPT_FTP_USE_EPRT: CURLoption = 106;
pub const CURLoption_CURLOPT_HTTPAUTH: CURLoption = 107;
pub const CURLoption_CURLOPT_SSL_CTX_FUNCTION: CURLoption = 20108;
pub const CURLoption_CURLOPT_SSL_CTX_DATA: CURLoption = 10109;
pub const CURLoption_CURLOPT_FTP_CREATE_MISSING_DIRS: CURLoption = 110;
pub const CURLoption_CURLOPT_PROXYAUTH: CURLoption = 111;
pub const CURLoption_CURLOPT_SERVER_RESPONSE_TIMEOUT: CURLoption = 112;
pub const CURLoption_CURLOPT_IPRESOLVE: CURLoption = 113;
pub const CURLoption_CURLOPT_MAXFILESIZE: CURLoption = 114;
pub const CURLoption_CURLOPT_INFILESIZE_LARGE: CURLoption = 30115;
pub const CURLoption_CURLOPT_RESUME_FROM_LARGE: CURLoption = 30116;
pub const CURLoption_CURLOPT_MAXFILESIZE_LARGE: CURLoption = 30117;
pub const CURLoption_CURLOPT_NETRC_FILE: CURLoption = 10118;
pub const CURLoption_CURLOPT_USE_SSL: CURLoption = 119;
pub const CURLoption_CURLOPT_POSTFIELDSIZE_LARGE: CURLoption = 30120;
pub const CURLoption_CURLOPT_TCP_NODELAY: CURLoption = 121;
pub const CURLoption_CURLOPT_FTPSSLAUTH: CURLoption = 129;
pub const CURLoption_CURLOPT_IOCTLFUNCTION: CURLoption = 20130;
pub const CURLoption_CURLOPT_IOCTLDATA: CURLoption = 10131;
pub const CURLoption_CURLOPT_FTP_ACCOUNT: CURLoption = 10134;
pub const CURLoption_CURLOPT_COOKIELIST: CURLoption = 10135;
pub const CURLoption_CURLOPT_IGNORE_CONTENT_LENGTH: CURLoption = 136;
pub const CURLoption_CURLOPT_FTP_SKIP_PASV_IP: CURLoption = 137;
pub const CURLoption_CURLOPT_FTP_FILEMETHOD: CURLoption = 138;
pub const CURLoption_CURLOPT_LOCALPORT: CURLoption = 139;
pub const CURLoption_CURLOPT_LOCALPORTRANGE: CURLoption = 140;
pub const CURLoption_CURLOPT_CONNECT_ONLY: CURLoption = 141;
pub const CURLoption_CURLOPT_CONV_FROM_NETWORK_FUNCTION: CURLoption = 20142;
pub const CURLoption_CURLOPT_CONV_TO_NETWORK_FUNCTION: CURLoption = 20143;
pub const CURLoption_CURLOPT_CONV_FROM_UTF8_FUNCTION: CURLoption = 20144;
pub const CURLoption_CURLOPT_MAX_SEND_SPEED_LARGE: CURLoption = 30145;
pub const CURLoption_CURLOPT_MAX_RECV_SPEED_LARGE: CURLoption = 30146;
pub const CURLoption_CURLOPT_FTP_ALTERNATIVE_TO_USER: CURLoption = 10147;
pub const CURLoption_CURLOPT_SOCKOPTFUNCTION: CURLoption = 20148;
pub const CURLoption_CURLOPT_SOCKOPTDATA: CURLoption = 10149;
pub const CURLoption_CURLOPT_SSL_SESSIONID_CACHE: CURLoption = 150;
pub const CURLoption_CURLOPT_SSH_AUTH_TYPES: CURLoption = 151;
pub const CURLoption_CURLOPT_SSH_PUBLIC_KEYFILE: CURLoption = 10152;
pub const CURLoption_CURLOPT_SSH_PRIVATE_KEYFILE: CURLoption = 10153;
pub const CURLoption_CURLOPT_FTP_SSL_CCC: CURLoption = 154;
pub const CURLoption_CURLOPT_TIMEOUT_MS: CURLoption = 155;
pub const CURLoption_CURLOPT_CONNECTTIMEOUT_MS: CURLoption = 156;
pub const CURLoption_CURLOPT_HTTP_TRANSFER_DECODING: CURLoption = 157;
pub const CURLoption_CURLOPT_HTTP_CONTENT_DECODING: CURLoption = 158;
pub const CURLoption_CURLOPT_NEW_FILE_PERMS: CURLoption = 159;
pub const CURLoption_CURLOPT_NEW_DIRECTORY_PERMS: CURLoption = 160;
pub const CURLoption_CURLOPT_POSTREDIR: CURLoption = 161;
pub const CURLoption_CURLOPT_SSH_HOST_PUBLIC_KEY_MD5: CURLoption = 10162;
pub const CURLoption_CURLOPT_OPENSOCKETFUNCTION: CURLoption = 20163;
pub const CURLoption_CURLOPT_OPENSOCKETDATA: CURLoption = 10164;
pub const CURLoption_CURLOPT_COPYPOSTFIELDS: CURLoption = 10165;
pub const CURLoption_CURLOPT_PROXY_TRANSFER_MODE: CURLoption = 166;
pub const CURLoption_CURLOPT_SEEKFUNCTION: CURLoption = 20167;
pub const CURLoption_CURLOPT_SEEKDATA: CURLoption = 10168;
pub const CURLoption_CURLOPT_CRLFILE: CURLoption = 10169;
pub const CURLoption_CURLOPT_ISSUERCERT: CURLoption = 10170;
pub const CURLoption_CURLOPT_ADDRESS_SCOPE: CURLoption = 171;
pub const CURLoption_CURLOPT_CERTINFO: CURLoption = 172;
pub const CURLoption_CURLOPT_USERNAME: CURLoption = 10173;
pub const CURLoption_CURLOPT_PASSWORD: CURLoption = 10174;
pub const CURLoption_CURLOPT_PROXYUSERNAME: CURLoption = 10175;
pub const CURLoption_CURLOPT_PROXYPASSWORD: CURLoption = 10176;
pub const CURLoption_CURLOPT_NOPROXY: CURLoption = 10177;
pub const CURLoption_CURLOPT_TFTP_BLKSIZE: CURLoption = 178;
pub const CURLoption_CURLOPT_SOCKS5_GSSAPI_SERVICE: CURLoption = 10179;
pub const CURLoption_CURLOPT_SOCKS5_GSSAPI_NEC: CURLoption = 180;
pub const CURLoption_CURLOPT_PROTOCOLS: CURLoption = 181;
pub const CURLoption_CURLOPT_REDIR_PROTOCOLS: CURLoption = 182;
pub const CURLoption_CURLOPT_SSH_KNOWNHOSTS: CURLoption = 10183;
pub const CURLoption_CURLOPT_SSH_KEYFUNCTION: CURLoption = 20184;
pub const CURLoption_CURLOPT_SSH_KEYDATA: CURLoption = 10185;
pub const CURLoption_CURLOPT_MAIL_FROM: CURLoption = 10186;
pub const CURLoption_CURLOPT_MAIL_RCPT: CURLoption = 10187;
pub const CURLoption_CURLOPT_FTP_USE_PRET: CURLoption = 188;
pub const CURLoption_CURLOPT_RTSP_REQUEST: CURLoption = 189;
pub const CURLoption_CURLOPT_RTSP_SESSION_ID: CURLoption = 10190;
pub const CURLoption_CURLOPT_RTSP_STREAM_URI: CURLoption = 10191;
pub const CURLoption_CURLOPT_RTSP_TRANSPORT: CURLoption = 10192;
pub const CURLoption_CURLOPT_RTSP_CLIENT_CSEQ: CURLoption = 193;
pub const CURLoption_CURLOPT_RTSP_SERVER_CSEQ: CURLoption = 194;
pub const CURLoption_CURLOPT_INTERLEAVEDATA: CURLoption = 10195;
pub const CURLoption_CURLOPT_INTERLEAVEFUNCTION: CURLoption = 20196;
pub const CURLoption_CURLOPT_WILDCARDMATCH: CURLoption = 197;
pub const CURLoption_CURLOPT_CHUNK_BGN_FUNCTION: CURLoption = 20198;
pub const CURLoption_CURLOPT_CHUNK_END_FUNCTION: CURLoption = 20199;
pub const CURLoption_CURLOPT_FNMATCH_FUNCTION: CURLoption = 20200;
pub const CURLoption_CURLOPT_CHUNK_DATA: CURLoption = 10201;
pub const CURLoption_CURLOPT_FNMATCH_DATA: CURLoption = 10202;
pub const CURLoption_CURLOPT_RESOLVE: CURLoption = 10203;
pub const CURLoption_CURLOPT_TLSAUTH_USERNAME: CURLoption = 10204;
pub const CURLoption_CURLOPT_TLSAUTH_PASSWORD: CURLoption = 10205;
pub const CURLoption_CURLOPT_TLSAUTH_TYPE: CURLoption = 10206;
pub const CURLoption_CURLOPT_TRANSFER_ENCODING: CURLoption = 207;
pub const CURLoption_CURLOPT_CLOSESOCKETFUNCTION: CURLoption = 20208;
pub const CURLoption_CURLOPT_CLOSESOCKETDATA: CURLoption = 10209;
pub const CURLoption_CURLOPT_GSSAPI_DELEGATION: CURLoption = 210;
pub const CURLoption_CURLOPT_DNS_SERVERS: CURLoption = 10211;
pub const CURLoption_CURLOPT_ACCEPTTIMEOUT_MS: CURLoption = 212;
pub const CURLoption_CURLOPT_TCP_KEEPALIVE: CURLoption = 213;
pub const CURLoption_CURLOPT_TCP_KEEPIDLE: CURLoption = 214;
pub const CURLoption_CURLOPT_TCP_KEEPINTVL: CURLoption = 215;
pub const CURLoption_CURLOPT_SSL_OPTIONS: CURLoption = 216;
pub const CURLoption_CURLOPT_MAIL_AUTH: CURLoption = 10217;
pub const CURLoption_CURLOPT_SASL_IR: CURLoption = 218;
pub const CURLoption_CURLOPT_XFERINFOFUNCTION: CURLoption = 20219;
pub const CURLoption_CURLOPT_XOAUTH2_BEARER: CURLoption = 10220;
pub const CURLoption_CURLOPT_DNS_INTERFACE: CURLoption = 10221;
pub const CURLoption_CURLOPT_DNS_LOCAL_IP4: CURLoption = 10222;
pub const CURLoption_CURLOPT_DNS_LOCAL_IP6: CURLoption = 10223;
pub const CURLoption_CURLOPT_LOGIN_OPTIONS: CURLoption = 10224;
pub const CURLoption_CURLOPT_SSL_ENABLE_NPN: CURLoption = 225;
pub const CURLoption_CURLOPT_SSL_ENABLE_ALPN: CURLoption = 226;
pub const CURLoption_CURLOPT_EXPECT_100_TIMEOUT_MS: CURLoption = 227;
pub const CURLoption_CURLOPT_PROXYHEADER: CURLoption = 10228;
pub const CURLoption_CURLOPT_HEADEROPT: CURLoption = 229;
pub const CURLoption_CURLOPT_PINNEDPUBLICKEY: CURLoption = 10230;
pub const CURLoption_CURLOPT_UNIX_SOCKET_PATH: CURLoption = 10231;
pub const CURLoption_CURLOPT_SSL_VERIFYSTATUS: CURLoption = 232;
pub const CURLoption_CURLOPT_SSL_FALSESTART: CURLoption = 233;
pub const CURLoption_CURLOPT_PATH_AS_IS: CURLoption = 234;
pub const CURLoption_CURLOPT_PROXY_SERVICE_NAME: CURLoption = 10235;
pub const CURLoption_CURLOPT_SERVICE_NAME: CURLoption = 10236;
pub const CURLoption_CURLOPT_PIPEWAIT: CURLoption = 237;
pub const CURLoption_CURLOPT_DEFAULT_PROTOCOL: CURLoption = 10238;
pub const CURLoption_CURLOPT_STREAM_WEIGHT: CURLoption = 239;
pub const CURLoption_CURLOPT_STREAM_DEPENDS: CURLoption = 10240;
pub const CURLoption_CURLOPT_STREAM_DEPENDS_E: CURLoption = 10241;
pub const CURLoption_CURLOPT_TFTP_NO_OPTIONS: CURLoption = 242;
pub const CURLoption_CURLOPT_CONNECT_TO: CURLoption = 10243;
pub const CURLoption_CURLOPT_TCP_FASTOPEN: CURLoption = 244;
pub const CURLoption_CURLOPT_KEEP_SENDING_ON_ERROR: CURLoption = 245;
pub const CURLoption_CURLOPT_PROXY_CAINFO: CURLoption = 10246;
pub const CURLoption_CURLOPT_PROXY_CAPATH: CURLoption = 10247;
pub const CURLoption_CURLOPT_PROXY_SSL_VERIFYPEER: CURLoption = 248;
pub const CURLoption_CURLOPT_PROXY_SSL_VERIFYHOST: CURLoption = 249;
pub const CURLoption_CURLOPT_PROXY_SSLVERSION: CURLoption = 250;
pub const CURLoption_CURLOPT_PROXY_TLSAUTH_USERNAME: CURLoption = 10251;
pub const CURLoption_CURLOPT_PROXY_TLSAUTH_PASSWORD: CURLoption = 10252;
pub const CURLoption_CURLOPT_PROXY_TLSAUTH_TYPE: CURLoption = 10253;
pub const CURLoption_CURLOPT_PROXY_SSLCERT: CURLoption = 10254;
pub const CURLoption_CURLOPT_PROXY_SSLCERTTYPE: CURLoption = 10255;
pub const CURLoption_CURLOPT_PROXY_SSLKEY: CURLoption = 10256;
pub const CURLoption_CURLOPT_PROXY_SSLKEYTYPE: CURLoption = 10257;
pub const CURLoption_CURLOPT_PROXY_KEYPASSWD: CURLoption = 10258;
pub const CURLoption_CURLOPT_PROXY_SSL_CIPHER_LIST: CURLoption = 10259;
pub const CURLoption_CURLOPT_PROXY_CRLFILE: CURLoption = 10260;
pub const CURLoption_CURLOPT_PROXY_SSL_OPTIONS: CURLoption = 261;
pub const CURLoption_CURLOPT_PRE_PROXY: CURLoption = 10262;
pub const CURLoption_CURLOPT_PROXY_PINNEDPUBLICKEY: CURLoption = 10263;
pub const CURLoption_CURLOPT_ABSTRACT_UNIX_SOCKET: CURLoption = 10264;
pub const CURLoption_CURLOPT_SUPPRESS_CONNECT_HEADERS: CURLoption = 265;
pub const CURLoption_CURLOPT_REQUEST_TARGET: CURLoption = 10266;
pub const CURLoption_CURLOPT_SOCKS5_AUTH: CURLoption = 267;
pub const CURLoption_CURLOPT_SSH_COMPRESSION: CURLoption = 268;
pub const CURLoption_CURLOPT_MIMEPOST: CURLoption = 10269;
pub const CURLoption_CURLOPT_TIMEVALUE_LARGE: CURLoption = 30270;
pub const CURLoption_CURLOPT_HAPPY_EYEBALLS_TIMEOUT_MS: CURLoption = 271;
pub const CURLoption_CURLOPT_RESOLVER_START_FUNCTION: CURLoption = 20272;
pub const CURLoption_CURLOPT_RESOLVER_START_DATA: CURLoption = 10273;
pub const CURLoption_CURLOPT_HAPROXYPROTOCOL: CURLoption = 274;
pub const CURLoption_CURLOPT_DNS_SHUFFLE_ADDRESSES: CURLoption = 275;
pub const CURLoption_CURLOPT_TLS13_CIPHERS: CURLoption = 10276;
pub const CURLoption_CURLOPT_PROXY_TLS13_CIPHERS: CURLoption = 10277;
pub const CURLoption_CURLOPT_DISALLOW_USERNAME_IN_URL: CURLoption = 278;
pub const CURLoption_CURLOPT_DOH_URL: CURLoption = 10279;
pub const CURLoption_CURLOPT_UPLOAD_BUFFERSIZE: CURLoption = 280;
pub const CURLoption_CURLOPT_UPKEEP_INTERVAL_MS: CURLoption = 281;
pub const CURLoption_CURLOPT_CURLU: CURLoption = 10282;
pub const CURLoption_CURLOPT_TRAILERFUNCTION: CURLoption = 20283;
pub const CURLoption_CURLOPT_TRAILERDATA: CURLoption = 10284;
pub const CURLoption_CURLOPT_HTTP09_ALLOWED: CURLoption = 285;
pub const CURLoption_CURLOPT_ALTSVC_CTRL: CURLoption = 286;
pub const CURLoption_CURLOPT_ALTSVC: CURLoption = 10287;
pub const CURLoption_CURLOPT_MAXAGE_CONN: CURLoption = 288;
pub const CURLoption_CURLOPT_SASL_AUTHZID: CURLoption = 10289;
pub const CURLoption_CURLOPT_MAIL_RCPT_ALLOWFAILS: CURLoption = 290;
pub const CURLoption_CURLOPT_SSLCERT_BLOB: CURLoption = 40291;
pub const CURLoption_CURLOPT_SSLKEY_BLOB: CURLoption = 40292;
pub const CURLoption_CURLOPT_PROXY_SSLCERT_BLOB: CURLoption = 40293;
pub const CURLoption_CURLOPT_PROXY_SSLKEY_BLOB: CURLoption = 40294;
pub const CURLoption_CURLOPT_ISSUERCERT_BLOB: CURLoption = 40295;
pub const CURLoption_CURLOPT_PROXY_ISSUERCERT: CURLoption = 10296;
pub const CURLoption_CURLOPT_PROXY_ISSUERCERT_BLOB: CURLoption = 40297;
pub const CURLoption_CURLOPT_SSL_EC_CURVES: CURLoption = 10298;
pub const CURLoption_CURLOPT_HSTS_CTRL: CURLoption = 299;
pub const CURLoption_CURLOPT_HSTS: CURLoption = 10300;
pub const CURLoption_CURLOPT_HSTSREADFUNCTION: CURLoption = 20301;
pub const CURLoption_CURLOPT_HSTSREADDATA: CURLoption = 10302;
pub const CURLoption_CURLOPT_HSTSWRITEFUNCTION: CURLoption = 20303;
pub const CURLoption_CURLOPT_HSTSWRITEDATA: CURLoption = 10304;
pub const CURLoption_CURLOPT_AWS_SIGV4: CURLoption = 10305;
pub const CURLoption_CURLOPT_DOH_SSL_VERIFYPEER: CURLoption = 306;
pub const CURLoption_CURLOPT_DOH_SSL_VERIFYHOST: CURLoption = 307;
pub const CURLoption_CURLOPT_DOH_SSL_VERIFYSTATUS: CURLoption = 308;
pub const CURLoption_CURLOPT_CAINFO_BLOB: CURLoption = 40309;
pub const CURLoption_CURLOPT_PROXY_CAINFO_BLOB: CURLoption = 40310;
pub const CURLoption_CURLOPT_SSH_HOST_PUBLIC_KEY_SHA256: CURLoption = 10311;
pub const CURLoption_CURLOPT_PREREQFUNCTION: CURLoption = 20312;
pub const CURLoption_CURLOPT_PREREQDATA: CURLoption = 10313;
pub const CURLoption_CURLOPT_MAXLIFETIME_CONN: CURLoption = 314;
pub const CURLoption_CURLOPT_MIME_OPTIONS: CURLoption = 315;
pub const CURLoption_CURLOPT_SSH_HOSTKEYFUNCTION: CURLoption = 20316;
pub const CURLoption_CURLOPT_SSH_HOSTKEYDATA: CURLoption = 10317;
pub const CURLoption_CURLOPT_PROTOCOLS_STR: CURLoption = 10318;
pub const CURLoption_CURLOPT_REDIR_PROTOCOLS_STR: CURLoption = 10319;
pub const CURLoption_CURLOPT_WS_OPTIONS: CURLoption = 320;
pub const CURLoption_CURLOPT_CA_CACHE_TIMEOUT: CURLoption = 321;
pub const CURLoption_CURLOPT_QUICK_EXIT: CURLoption = 322;
pub const CURLoption_CURLOPT_HAPROXY_CLIENT_IP: CURLoption = 10323;
pub const CURLoption_CURLOPT_SERVER_RESPONSE_TIMEOUT_MS: CURLoption = 324;
pub const CURLoption_CURLOPT_ECH: CURLoption = 10325;
pub const CURLoption_CURLOPT_TCP_KEEPCNT: CURLoption = 326;
pub const CURLoption_CURLOPT_UPLOAD_FLAGS: CURLoption = 327;
pub const CURLoption_CURLOPT_SSL_SIGNATURE_ALGORITHMS: CURLoption = 10328;
pub const CURLoption_CURLOPT_LASTENTRY: CURLoption = 10329;
pub type CURLoption = ::std::os::raw::c_uint;
pub const CURL_NETRC_OPTION_CURL_NETRC_LAST: CURL_NETRC_OPTION = 3;
pub type CURL_NETRC_OPTION = ::std::os::raw::c_uint;
pub const CURL_TLSAUTH_CURL_TLSAUTH_LAST: CURL_TLSAUTH = 2;
pub type CURL_TLSAUTH = ::std::os::raw::c_uint;
pub const curl_TimeCond_CURL_TIMECOND_LAST: curl_TimeCond = 4;
pub type curl_TimeCond = ::std::os::raw::c_uint;
extern "C" {
    pub fn curl_strequal(
        s1: *const ::std::os::raw::c_char,
        s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn curl_strnequal(
        s1: *const ::std::os::raw::c_char,
        s2: *const ::std::os::raw::c_char,
        n: usize,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct curl_mime {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct curl_mimepart {
    _unused: [u8; 0],
}
extern "C" {
    pub fn curl_mime_init(easy: *mut CURL) -> *mut curl_mime;
}
extern "C" {
    pub fn curl_mime_free(mime: *mut curl_mime);
}
extern "C" {
    pub fn curl_mime_addpart(mime: *mut curl_mime) -> *mut curl_mimepart;
}
extern "C" {
    pub fn curl_mime_name(
        part: *mut curl_mimepart,
        name: *const ::std::os::raw::c_char,
    ) -> CURLcode;
}
extern "C" {
    pub fn curl_mime_filename(
        part: *mut curl_mimepart,
        filename: *const ::std::os::raw::c_char,
    ) -> CURLcode;
}
extern "C" {
    pub fn curl_mime_type(
        part: *mut curl_mimepart,
        mimetype: *const ::std::os::raw::c_char,
    ) -> CURLcode;
}
extern "C" {
    pub fn curl_mime_encoder(
        part: *mut curl_mimepart,
        encoding: *const ::std::os::raw::c_char,
    ) -> CURLcode;
}
extern "C" {
    pub fn curl_mime_data(
        part: *mut curl_mimepart,
        data: *const ::std::os::raw::c_char,
        datasize: usize,
    ) -> CURLcode;
}
extern "C" {
    pub fn curl_mime_filedata(
        part: *mut curl_mimepart,
        filename: *const ::std::os::raw::c_char,
    ) -> CURLcode;
}
extern "C" {
    pub fn curl_mime_data_cb(
        part: *mut curl_mimepart,
        datasize: curl_off_t,
        readfunc: curl_read_callback,
        seekfunc: curl_seek_callback,
        freefunc: curl_free_callback,
        arg: *mut ::std::os::raw::c_void,
    ) -> CURLcode;
}
extern "C" {
    pub fn curl_mime_subparts(part: *mut curl_mimepart, subparts: *mut curl_mime) -> CURLcode;
}
extern "C" {
    pub fn curl_mime_headers(
        part: *mut curl_mimepart,
        headers: *mut curl_slist,
        take_ownership: ::std::os::raw::c_int,
    ) -> CURLcode;
}
#[doc = " the first one is unused"]
pub const CURLformoption_CURLFORM_NOTHING: CURLformoption = 0;
#[doc = " the first one is unused"]
pub const CURLformoption_CURLFORM_COPYNAME: CURLformoption = 1;
#[doc = " the first one is unused"]
pub const CURLformoption_CURLFORM_PTRNAME: CURLformoption = 2;
#[doc = " the first one is unused"]
pub const CURLformoption_CURLFORM_NAMELENGTH: CURLformoption = 3;
#[doc = " the first one is unused"]
pub const CURLformoption_CURLFORM_COPYCONTENTS: CURLformoption = 4;
#[doc = " the first one is unused"]
pub const CURLformoption_CURLFORM_PTRCONTENTS: CURLformoption = 5;
#[doc = " the first one is unused"]
pub const CURLformoption_CURLFORM_CONTENTSLENGTH: CURLformoption = 6;
#[doc = " the first one is unused"]
pub const CURLformoption_CURLFORM_FILECONTENT: CURLformoption = 7;
#[doc = " the first one is unused"]
pub const CURLformoption_CURLFORM_ARRAY: CURLformoption = 8;
#[doc = " the first one is unused"]
pub const CURLformoption_CURLFORM_OBSOLETE: CURLformoption = 9;
#[doc = " the first one is unused"]
pub const CURLformoption_CURLFORM_FILE: CURLformoption = 10;
#[doc = " the first one is unused"]
pub const CURLformoption_CURLFORM_BUFFER: CURLformoption = 11;
#[doc = " the first one is unused"]
pub const CURLformoption_CURLFORM_BUFFERPTR: CURLformoption = 12;
#[doc = " the first one is unused"]
pub const CURLformoption_CURLFORM_BUFFERLENGTH: CURLformoption = 13;
#[doc = " the first one is unused"]
pub const CURLformoption_CURLFORM_CONTENTTYPE: CURLformoption = 14;
#[doc = " the first one is unused"]
pub const CURLformoption_CURLFORM_CONTENTHEADER: CURLformoption = 15;
#[doc = " the first one is unused"]
pub const CURLformoption_CURLFORM_FILENAME: CURLformoption = 16;
#[doc = " the first one is unused"]
pub const CURLformoption_CURLFORM_END: CURLformoption = 17;
#[doc = " the first one is unused"]
pub const CURLformoption_CURLFORM_OBSOLETE2: CURLformoption = 18;
#[doc = " the first one is unused"]
pub const CURLformoption_CURLFORM_STREAM: CURLformoption = 19;
#[doc = " the first one is unused"]
pub const CURLformoption_CURLFORM_CONTENTLEN: CURLformoption = 20;
#[doc = " the first one is unused"]
pub const CURLformoption_CURLFORM_LASTENTRY: CURLformoption = 21;
pub type CURLformoption = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct curl_forms {
    pub option: CURLformoption,
    pub value: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_curl_forms() {
    const UNINIT: ::std::mem::MaybeUninit<curl_forms> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<curl_forms>(),
        16usize,
        concat!("Size of: ", stringify!(curl_forms))
    );
    assert_eq!(
        ::std::mem::align_of::<curl_forms>(),
        8usize,
        concat!("Alignment of ", stringify!(curl_forms))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).option) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_forms),
            "::",
            stringify!(option)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_forms),
            "::",
            stringify!(value)
        )
    );
}
pub const CURLFORMcode_CURL_FORMADD_OK: CURLFORMcode = 0;
pub const CURLFORMcode_CURL_FORMADD_MEMORY: CURLFORMcode = 1;
pub const CURLFORMcode_CURL_FORMADD_OPTION_TWICE: CURLFORMcode = 2;
pub const CURLFORMcode_CURL_FORMADD_NULL: CURLFORMcode = 3;
pub const CURLFORMcode_CURL_FORMADD_UNKNOWN_OPTION: CURLFORMcode = 4;
pub const CURLFORMcode_CURL_FORMADD_INCOMPLETE: CURLFORMcode = 5;
pub const CURLFORMcode_CURL_FORMADD_ILLEGAL_ARRAY: CURLFORMcode = 6;
pub const CURLFORMcode_CURL_FORMADD_DISABLED: CURLFORMcode = 7;
pub const CURLFORMcode_CURL_FORMADD_LAST: CURLFORMcode = 8;
pub type CURLFORMcode = ::std::os::raw::c_uint;
extern "C" {
    pub fn curl_formadd(
        httppost: *mut *mut curl_httppost,
        last_post: *mut *mut curl_httppost,
        ...
    ) -> CURLFORMcode;
}
pub type curl_formget_callback = ::std::option::Option<
    unsafe extern "C" fn(
        arg: *mut ::std::os::raw::c_void,
        buf: *const ::std::os::raw::c_char,
        len: usize,
    ) -> usize,
>;
extern "C" {
    pub fn curl_formget(
        form: *mut curl_httppost,
        arg: *mut ::std::os::raw::c_void,
        append: curl_formget_callback,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn curl_formfree(form: *mut curl_httppost);
}
extern "C" {
    pub fn curl_getenv(variable: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn curl_version() -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn curl_easy_escape(
        handle: *mut CURL,
        string: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn curl_escape(
        string: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn curl_easy_unescape(
        handle: *mut CURL,
        string: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_int,
        outlength: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn curl_unescape(
        string: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn curl_free(p: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn curl_global_init(flags: ::std::os::raw::c_long) -> CURLcode;
}
extern "C" {
    pub fn curl_global_init_mem(
        flags: ::std::os::raw::c_long,
        m: curl_malloc_callback,
        f: curl_free_callback,
        r: curl_realloc_callback,
        s: curl_strdup_callback,
        c: curl_calloc_callback,
    ) -> CURLcode;
}
extern "C" {
    pub fn curl_global_cleanup();
}
extern "C" {
    pub fn curl_global_trace(config: *const ::std::os::raw::c_char) -> CURLcode;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct curl_slist {
    pub data: *mut ::std::os::raw::c_char,
    pub next: *mut curl_slist,
}
#[test]
fn bindgen_test_layout_curl_slist() {
    const UNINIT: ::std::mem::MaybeUninit<curl_slist> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<curl_slist>(),
        16usize,
        concat!("Size of: ", stringify!(curl_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<curl_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(curl_slist))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_slist),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_slist),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct curl_ssl_backend {
    pub id: curl_sslbackend,
    pub name: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_curl_ssl_backend() {
    const UNINIT: ::std::mem::MaybeUninit<curl_ssl_backend> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<curl_ssl_backend>(),
        16usize,
        concat!("Size of: ", stringify!(curl_ssl_backend))
    );
    assert_eq!(
        ::std::mem::align_of::<curl_ssl_backend>(),
        8usize,
        concat!("Alignment of ", stringify!(curl_ssl_backend))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_ssl_backend),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_ssl_backend),
            "::",
            stringify!(name)
        )
    );
}
pub const CURLsslset_CURLSSLSET_OK: CURLsslset = 0;
pub const CURLsslset_CURLSSLSET_UNKNOWN_BACKEND: CURLsslset = 1;
pub const CURLsslset_CURLSSLSET_TOO_LATE: CURLsslset = 2;
pub const CURLsslset_CURLSSLSET_NO_BACKENDS: CURLsslset = 3;
pub type CURLsslset = ::std::os::raw::c_uint;
extern "C" {
    pub fn curl_global_sslset(
        id: curl_sslbackend,
        name: *const ::std::os::raw::c_char,
        avail: *mut *mut *const curl_ssl_backend,
    ) -> CURLsslset;
}
extern "C" {
    pub fn curl_slist_append(
        list: *mut curl_slist,
        data: *const ::std::os::raw::c_char,
    ) -> *mut curl_slist;
}
extern "C" {
    pub fn curl_slist_free_all(list: *mut curl_slist);
}
extern "C" {
    pub fn curl_getdate(p: *const ::std::os::raw::c_char, unused: *const time_t) -> time_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct curl_certinfo {
    pub num_of_certs: ::std::os::raw::c_int,
    pub certinfo: *mut *mut curl_slist,
}
#[test]
fn bindgen_test_layout_curl_certinfo() {
    const UNINIT: ::std::mem::MaybeUninit<curl_certinfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<curl_certinfo>(),
        16usize,
        concat!("Size of: ", stringify!(curl_certinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<curl_certinfo>(),
        8usize,
        concat!("Alignment of ", stringify!(curl_certinfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_of_certs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_certinfo),
            "::",
            stringify!(num_of_certs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).certinfo) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_certinfo),
            "::",
            stringify!(certinfo)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct curl_tlssessioninfo {
    pub backend: curl_sslbackend,
    pub internals: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_curl_tlssessioninfo() {
    const UNINIT: ::std::mem::MaybeUninit<curl_tlssessioninfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<curl_tlssessioninfo>(),
        16usize,
        concat!("Size of: ", stringify!(curl_tlssessioninfo))
    );
    assert_eq!(
        ::std::mem::align_of::<curl_tlssessioninfo>(),
        8usize,
        concat!("Alignment of ", stringify!(curl_tlssessioninfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).backend) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_tlssessioninfo),
            "::",
            stringify!(backend)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).internals) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_tlssessioninfo),
            "::",
            stringify!(internals)
        )
    );
}
pub const CURLINFO_CURLINFO_NONE: CURLINFO = 0;
pub const CURLINFO_CURLINFO_EFFECTIVE_URL: CURLINFO = 1048577;
pub const CURLINFO_CURLINFO_RESPONSE_CODE: CURLINFO = 2097154;
pub const CURLINFO_CURLINFO_TOTAL_TIME: CURLINFO = 3145731;
pub const CURLINFO_CURLINFO_NAMELOOKUP_TIME: CURLINFO = 3145732;
pub const CURLINFO_CURLINFO_CONNECT_TIME: CURLINFO = 3145733;
pub const CURLINFO_CURLINFO_PRETRANSFER_TIME: CURLINFO = 3145734;
pub const CURLINFO_CURLINFO_SIZE_UPLOAD: CURLINFO = 3145735;
pub const CURLINFO_CURLINFO_SIZE_UPLOAD_T: CURLINFO = 6291463;
pub const CURLINFO_CURLINFO_SIZE_DOWNLOAD: CURLINFO = 3145736;
pub const CURLINFO_CURLINFO_SIZE_DOWNLOAD_T: CURLINFO = 6291464;
pub const CURLINFO_CURLINFO_SPEED_DOWNLOAD: CURLINFO = 3145737;
pub const CURLINFO_CURLINFO_SPEED_DOWNLOAD_T: CURLINFO = 6291465;
pub const CURLINFO_CURLINFO_SPEED_UPLOAD: CURLINFO = 3145738;
pub const CURLINFO_CURLINFO_SPEED_UPLOAD_T: CURLINFO = 6291466;
pub const CURLINFO_CURLINFO_HEADER_SIZE: CURLINFO = 2097163;
pub const CURLINFO_CURLINFO_REQUEST_SIZE: CURLINFO = 2097164;
pub const CURLINFO_CURLINFO_SSL_VERIFYRESULT: CURLINFO = 2097165;
pub const CURLINFO_CURLINFO_FILETIME: CURLINFO = 2097166;
pub const CURLINFO_CURLINFO_FILETIME_T: CURLINFO = 6291470;
pub const CURLINFO_CURLINFO_CONTENT_LENGTH_DOWNLOAD: CURLINFO = 3145743;
pub const CURLINFO_CURLINFO_CONTENT_LENGTH_DOWNLOAD_T: CURLINFO = 6291471;
pub const CURLINFO_CURLINFO_CONTENT_LENGTH_UPLOAD: CURLINFO = 3145744;
pub const CURLINFO_CURLINFO_CONTENT_LENGTH_UPLOAD_T: CURLINFO = 6291472;
pub const CURLINFO_CURLINFO_STARTTRANSFER_TIME: CURLINFO = 3145745;
pub const CURLINFO_CURLINFO_CONTENT_TYPE: CURLINFO = 1048594;
pub const CURLINFO_CURLINFO_REDIRECT_TIME: CURLINFO = 3145747;
pub const CURLINFO_CURLINFO_REDIRECT_COUNT: CURLINFO = 2097172;
pub const CURLINFO_CURLINFO_PRIVATE: CURLINFO = 1048597;
pub const CURLINFO_CURLINFO_HTTP_CONNECTCODE: CURLINFO = 2097174;
pub const CURLINFO_CURLINFO_HTTPAUTH_AVAIL: CURLINFO = 2097175;
pub const CURLINFO_CURLINFO_PROXYAUTH_AVAIL: CURLINFO = 2097176;
pub const CURLINFO_CURLINFO_OS_ERRNO: CURLINFO = 2097177;
pub const CURLINFO_CURLINFO_NUM_CONNECTS: CURLINFO = 2097178;
pub const CURLINFO_CURLINFO_SSL_ENGINES: CURLINFO = 4194331;
pub const CURLINFO_CURLINFO_COOKIELIST: CURLINFO = 4194332;
pub const CURLINFO_CURLINFO_LASTSOCKET: CURLINFO = 2097181;
pub const CURLINFO_CURLINFO_FTP_ENTRY_PATH: CURLINFO = 1048606;
pub const CURLINFO_CURLINFO_REDIRECT_URL: CURLINFO = 1048607;
pub const CURLINFO_CURLINFO_PRIMARY_IP: CURLINFO = 1048608;
pub const CURLINFO_CURLINFO_APPCONNECT_TIME: CURLINFO = 3145761;
pub const CURLINFO_CURLINFO_CERTINFO: CURLINFO = 4194338;
pub const CURLINFO_CURLINFO_CONDITION_UNMET: CURLINFO = 2097187;
pub const CURLINFO_CURLINFO_RTSP_SESSION_ID: CURLINFO = 1048612;
pub const CURLINFO_CURLINFO_RTSP_CLIENT_CSEQ: CURLINFO = 2097189;
pub const CURLINFO_CURLINFO_RTSP_SERVER_CSEQ: CURLINFO = 2097190;
pub const CURLINFO_CURLINFO_RTSP_CSEQ_RECV: CURLINFO = 2097191;
pub const CURLINFO_CURLINFO_PRIMARY_PORT: CURLINFO = 2097192;
pub const CURLINFO_CURLINFO_LOCAL_IP: CURLINFO = 1048617;
pub const CURLINFO_CURLINFO_LOCAL_PORT: CURLINFO = 2097194;
pub const CURLINFO_CURLINFO_TLS_SESSION: CURLINFO = 4194347;
pub const CURLINFO_CURLINFO_ACTIVESOCKET: CURLINFO = 5242924;
pub const CURLINFO_CURLINFO_TLS_SSL_PTR: CURLINFO = 4194349;
pub const CURLINFO_CURLINFO_HTTP_VERSION: CURLINFO = 2097198;
pub const CURLINFO_CURLINFO_PROXY_SSL_VERIFYRESULT: CURLINFO = 2097199;
pub const CURLINFO_CURLINFO_PROTOCOL: CURLINFO = 2097200;
pub const CURLINFO_CURLINFO_SCHEME: CURLINFO = 1048625;
pub const CURLINFO_CURLINFO_TOTAL_TIME_T: CURLINFO = 6291506;
pub const CURLINFO_CURLINFO_NAMELOOKUP_TIME_T: CURLINFO = 6291507;
pub const CURLINFO_CURLINFO_CONNECT_TIME_T: CURLINFO = 6291508;
pub const CURLINFO_CURLINFO_PRETRANSFER_TIME_T: CURLINFO = 6291509;
pub const CURLINFO_CURLINFO_STARTTRANSFER_TIME_T: CURLINFO = 6291510;
pub const CURLINFO_CURLINFO_REDIRECT_TIME_T: CURLINFO = 6291511;
pub const CURLINFO_CURLINFO_APPCONNECT_TIME_T: CURLINFO = 6291512;
pub const CURLINFO_CURLINFO_RETRY_AFTER: CURLINFO = 6291513;
pub const CURLINFO_CURLINFO_EFFECTIVE_METHOD: CURLINFO = 1048634;
pub const CURLINFO_CURLINFO_PROXY_ERROR: CURLINFO = 2097211;
pub const CURLINFO_CURLINFO_REFERER: CURLINFO = 1048636;
pub const CURLINFO_CURLINFO_CAINFO: CURLINFO = 1048637;
pub const CURLINFO_CURLINFO_CAPATH: CURLINFO = 1048638;
pub const CURLINFO_CURLINFO_XFER_ID: CURLINFO = 6291519;
pub const CURLINFO_CURLINFO_CONN_ID: CURLINFO = 6291520;
pub const CURLINFO_CURLINFO_QUEUE_TIME_T: CURLINFO = 6291521;
pub const CURLINFO_CURLINFO_USED_PROXY: CURLINFO = 2097218;
pub const CURLINFO_CURLINFO_POSTTRANSFER_TIME_T: CURLINFO = 6291523;
pub const CURLINFO_CURLINFO_EARLYDATA_SENT_T: CURLINFO = 6291524;
pub const CURLINFO_CURLINFO_HTTPAUTH_USED: CURLINFO = 2097221;
pub const CURLINFO_CURLINFO_PROXYAUTH_USED: CURLINFO = 2097222;
pub const CURLINFO_CURLINFO_LASTONE: CURLINFO = 70;
pub type CURLINFO = ::std::os::raw::c_uint;
pub const curl_closepolicy_CURLCLOSEPOLICY_NONE: curl_closepolicy = 0;
pub const curl_closepolicy_CURLCLOSEPOLICY_OLDEST: curl_closepolicy = 1;
pub const curl_closepolicy_CURLCLOSEPOLICY_LEAST_RECENTLY_USED: curl_closepolicy = 2;
pub const curl_closepolicy_CURLCLOSEPOLICY_LEAST_TRAFFIC: curl_closepolicy = 3;
pub const curl_closepolicy_CURLCLOSEPOLICY_SLOWEST: curl_closepolicy = 4;
pub const curl_closepolicy_CURLCLOSEPOLICY_CALLBACK: curl_closepolicy = 5;
pub const curl_closepolicy_CURLCLOSEPOLICY_LAST: curl_closepolicy = 6;
pub type curl_closepolicy = ::std::os::raw::c_uint;
pub const curl_lock_data_CURL_LOCK_DATA_NONE: curl_lock_data = 0;
pub const curl_lock_data_CURL_LOCK_DATA_SHARE: curl_lock_data = 1;
pub const curl_lock_data_CURL_LOCK_DATA_COOKIE: curl_lock_data = 2;
pub const curl_lock_data_CURL_LOCK_DATA_DNS: curl_lock_data = 3;
pub const curl_lock_data_CURL_LOCK_DATA_SSL_SESSION: curl_lock_data = 4;
pub const curl_lock_data_CURL_LOCK_DATA_CONNECT: curl_lock_data = 5;
pub const curl_lock_data_CURL_LOCK_DATA_PSL: curl_lock_data = 6;
pub const curl_lock_data_CURL_LOCK_DATA_HSTS: curl_lock_data = 7;
pub const curl_lock_data_CURL_LOCK_DATA_LAST: curl_lock_data = 8;
#[doc = " Setup defines, protos etc for the sharing stuff."]
pub type curl_lock_data = ::std::os::raw::c_uint;
pub const curl_lock_access_CURL_LOCK_ACCESS_NONE: curl_lock_access = 0;
pub const curl_lock_access_CURL_LOCK_ACCESS_SHARED: curl_lock_access = 1;
pub const curl_lock_access_CURL_LOCK_ACCESS_SINGLE: curl_lock_access = 2;
pub const curl_lock_access_CURL_LOCK_ACCESS_LAST: curl_lock_access = 3;
pub type curl_lock_access = ::std::os::raw::c_uint;
pub type curl_lock_function = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *mut CURL,
        data: curl_lock_data,
        locktype: curl_lock_access,
        userptr: *mut ::std::os::raw::c_void,
    ),
>;
pub type curl_unlock_function = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *mut CURL,
        data: curl_lock_data,
        userptr: *mut ::std::os::raw::c_void,
    ),
>;
pub const CURLSHcode_CURLSHE_OK: CURLSHcode = 0;
pub const CURLSHcode_CURLSHE_BAD_OPTION: CURLSHcode = 1;
pub const CURLSHcode_CURLSHE_IN_USE: CURLSHcode = 2;
pub const CURLSHcode_CURLSHE_INVALID: CURLSHcode = 3;
pub const CURLSHcode_CURLSHE_NOMEM: CURLSHcode = 4;
pub const CURLSHcode_CURLSHE_NOT_BUILT_IN: CURLSHcode = 5;
pub const CURLSHcode_CURLSHE_LAST: CURLSHcode = 6;
pub type CURLSHcode = ::std::os::raw::c_uint;
pub const CURLSHoption_CURLSHOPT_NONE: CURLSHoption = 0;
pub const CURLSHoption_CURLSHOPT_SHARE: CURLSHoption = 1;
pub const CURLSHoption_CURLSHOPT_UNSHARE: CURLSHoption = 2;
pub const CURLSHoption_CURLSHOPT_LOCKFUNC: CURLSHoption = 3;
pub const CURLSHoption_CURLSHOPT_UNLOCKFUNC: CURLSHoption = 4;
pub const CURLSHoption_CURLSHOPT_USERDATA: CURLSHoption = 5;
pub const CURLSHoption_CURLSHOPT_LAST: CURLSHoption = 6;
pub type CURLSHoption = ::std::os::raw::c_uint;
extern "C" {
    pub fn curl_share_init() -> *mut CURLSH;
}
extern "C" {
    pub fn curl_share_setopt(share: *mut CURLSH, option: CURLSHoption, ...) -> CURLSHcode;
}
extern "C" {
    pub fn curl_share_cleanup(share: *mut CURLSH) -> CURLSHcode;
}
pub const CURLversion_CURLVERSION_FIRST: CURLversion = 0;
pub const CURLversion_CURLVERSION_SECOND: CURLversion = 1;
pub const CURLversion_CURLVERSION_THIRD: CURLversion = 2;
pub const CURLversion_CURLVERSION_FOURTH: CURLversion = 3;
pub const CURLversion_CURLVERSION_FIFTH: CURLversion = 4;
pub const CURLversion_CURLVERSION_SIXTH: CURLversion = 5;
pub const CURLversion_CURLVERSION_SEVENTH: CURLversion = 6;
pub const CURLversion_CURLVERSION_EIGHTH: CURLversion = 7;
pub const CURLversion_CURLVERSION_NINTH: CURLversion = 8;
pub const CURLversion_CURLVERSION_TENTH: CURLversion = 9;
pub const CURLversion_CURLVERSION_ELEVENTH: CURLversion = 10;
pub const CURLversion_CURLVERSION_TWELFTH: CURLversion = 11;
pub const CURLversion_CURLVERSION_LAST: CURLversion = 12;
#[doc = " Structures for querying information about the curl library at runtime."]
pub type CURLversion = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct curl_version_info_data {
    pub age: CURLversion,
    pub version: *const ::std::os::raw::c_char,
    pub version_num: ::std::os::raw::c_uint,
    pub host: *const ::std::os::raw::c_char,
    pub features: ::std::os::raw::c_int,
    pub ssl_version: *const ::std::os::raw::c_char,
    pub ssl_version_num: ::std::os::raw::c_long,
    pub libz_version: *const ::std::os::raw::c_char,
    pub protocols: *const *const ::std::os::raw::c_char,
    pub ares: *const ::std::os::raw::c_char,
    pub ares_num: ::std::os::raw::c_int,
    pub libidn: *const ::std::os::raw::c_char,
    pub iconv_ver_num: ::std::os::raw::c_int,
    pub libssh_version: *const ::std::os::raw::c_char,
    pub brotli_ver_num: ::std::os::raw::c_uint,
    pub brotli_version: *const ::std::os::raw::c_char,
    pub nghttp2_ver_num: ::std::os::raw::c_uint,
    pub nghttp2_version: *const ::std::os::raw::c_char,
    pub quic_version: *const ::std::os::raw::c_char,
    pub cainfo: *const ::std::os::raw::c_char,
    pub capath: *const ::std::os::raw::c_char,
    pub zstd_ver_num: ::std::os::raw::c_uint,
    pub zstd_version: *const ::std::os::raw::c_char,
    pub hyper_version: *const ::std::os::raw::c_char,
    pub gsasl_version: *const ::std::os::raw::c_char,
    pub feature_names: *const *const ::std::os::raw::c_char,
    pub rtmp_version: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_curl_version_info_data() {
    const UNINIT: ::std::mem::MaybeUninit<curl_version_info_data> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<curl_version_info_data>(),
        216usize,
        concat!("Size of: ", stringify!(curl_version_info_data))
    );
    assert_eq!(
        ::std::mem::align_of::<curl_version_info_data>(),
        8usize,
        concat!("Alignment of ", stringify!(curl_version_info_data))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).age) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(age)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version_num) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(version_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(host)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).features) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(features)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ssl_version) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(ssl_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ssl_version_num) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(ssl_version_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).libz_version) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(libz_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).protocols) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(protocols)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ares) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(ares)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ares_num) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(ares_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).libidn) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(libidn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iconv_ver_num) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(iconv_ver_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).libssh_version) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(libssh_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).brotli_ver_num) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(brotli_ver_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).brotli_version) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(brotli_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nghttp2_ver_num) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(nghttp2_ver_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nghttp2_version) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(nghttp2_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quic_version) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(quic_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cainfo) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(cainfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capath) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(capath)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).zstd_ver_num) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(zstd_ver_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).zstd_version) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(zstd_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hyper_version) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(hyper_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gsasl_version) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(gsasl_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).feature_names) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(feature_names)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtmp_version) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_version_info_data),
            "::",
            stringify!(rtmp_version)
        )
    );
}
extern "C" {
    pub fn curl_version_info(arg1: CURLversion) -> *mut curl_version_info_data;
}
extern "C" {
    pub fn curl_easy_strerror(arg1: CURLcode) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn curl_share_strerror(arg1: CURLSHcode) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn curl_easy_pause(handle: *mut CURL, bitmask: ::std::os::raw::c_int) -> CURLcode;
}
extern "C" {
    pub fn curl_easy_ssls_import(
        handle: *mut CURL,
        session_key: *const ::std::os::raw::c_char,
        shmac: *const ::std::os::raw::c_uchar,
        shmac_len: usize,
        sdata: *const ::std::os::raw::c_uchar,
        sdata_len: usize,
    ) -> CURLcode;
}
pub type curl_ssls_export_cb = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *mut CURL,
        userptr: *mut ::std::os::raw::c_void,
        session_key: *const ::std::os::raw::c_char,
        shmac: *const ::std::os::raw::c_uchar,
        shmac_len: usize,
        sdata: *const ::std::os::raw::c_uchar,
        sdata_len: usize,
        valid_until: curl_off_t,
        ietf_tls_id: ::std::os::raw::c_int,
        alpn: *const ::std::os::raw::c_char,
        earlydata_max: usize,
    ) -> CURLcode,
>;
extern "C" {
    pub fn curl_easy_ssls_export(
        handle: *mut CURL,
        export_fn: curl_ssls_export_cb,
        userptr: *mut ::std::os::raw::c_void,
    ) -> CURLcode;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct curl_blob {
    pub data: *mut ::std::os::raw::c_void,
    pub len: usize,
    pub flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_curl_blob() {
    const UNINIT: ::std::mem::MaybeUninit<curl_blob> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<curl_blob>(),
        24usize,
        concat!("Size of: ", stringify!(curl_blob))
    );
    assert_eq!(
        ::std::mem::align_of::<curl_blob>(),
        8usize,
        concat!("Alignment of ", stringify!(curl_blob))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_blob),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_blob),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_blob),
            "::",
            stringify!(flags)
        )
    );
}
extern "C" {
    pub fn curl_easy_init() -> *mut CURL;
}
extern "C" {
    pub fn curl_easy_setopt(curl: *mut CURL, option: CURLoption, ...) -> CURLcode;
}
extern "C" {
    pub fn curl_easy_perform(curl: *mut CURL) -> CURLcode;
}
extern "C" {
    pub fn curl_easy_cleanup(curl: *mut CURL);
}
extern "C" {
    pub fn curl_easy_getinfo(curl: *mut CURL, info: CURLINFO, ...) -> CURLcode;
}
extern "C" {
    pub fn curl_easy_duphandle(curl: *mut CURL) -> *mut CURL;
}
extern "C" {
    pub fn curl_easy_reset(curl: *mut CURL);
}
extern "C" {
    pub fn curl_easy_recv(
        curl: *mut CURL,
        buffer: *mut ::std::os::raw::c_void,
        buflen: usize,
        n: *mut usize,
    ) -> CURLcode;
}
extern "C" {
    pub fn curl_easy_send(
        curl: *mut CURL,
        buffer: *const ::std::os::raw::c_void,
        buflen: usize,
        n: *mut usize,
    ) -> CURLcode;
}
extern "C" {
    pub fn curl_easy_upkeep(curl: *mut CURL) -> CURLcode;
}
pub type CURLM = ::std::os::raw::c_void;
pub const CURLMcode_CURLM_CALL_MULTI_PERFORM: CURLMcode = -1;
pub const CURLMcode_CURLM_OK: CURLMcode = 0;
pub const CURLMcode_CURLM_BAD_HANDLE: CURLMcode = 1;
pub const CURLMcode_CURLM_BAD_EASY_HANDLE: CURLMcode = 2;
pub const CURLMcode_CURLM_OUT_OF_MEMORY: CURLMcode = 3;
pub const CURLMcode_CURLM_INTERNAL_ERROR: CURLMcode = 4;
pub const CURLMcode_CURLM_BAD_SOCKET: CURLMcode = 5;
pub const CURLMcode_CURLM_UNKNOWN_OPTION: CURLMcode = 6;
pub const CURLMcode_CURLM_ADDED_ALREADY: CURLMcode = 7;
pub const CURLMcode_CURLM_RECURSIVE_API_CALL: CURLMcode = 8;
pub const CURLMcode_CURLM_WAKEUP_FAILURE: CURLMcode = 9;
pub const CURLMcode_CURLM_BAD_FUNCTION_ARGUMENT: CURLMcode = 10;
pub const CURLMcode_CURLM_ABORTED_BY_CALLBACK: CURLMcode = 11;
pub const CURLMcode_CURLM_UNRECOVERABLE_POLL: CURLMcode = 12;
pub const CURLMcode_CURLM_LAST: CURLMcode = 13;
pub type CURLMcode = ::std::os::raw::c_int;
pub const CURLMSG_CURLMSG_NONE: CURLMSG = 0;
pub const CURLMSG_CURLMSG_DONE: CURLMSG = 1;
pub const CURLMSG_CURLMSG_LAST: CURLMSG = 2;
pub type CURLMSG = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CURLMsg {
    pub msg: CURLMSG,
    pub easy_handle: *mut CURL,
    pub data: CURLMsg__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CURLMsg__bindgen_ty_1 {
    pub whatever: *mut ::std::os::raw::c_void,
    pub result: CURLcode,
}
#[test]
fn bindgen_test_layout_CURLMsg__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<CURLMsg__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CURLMsg__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(CURLMsg__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<CURLMsg__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(CURLMsg__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).whatever) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CURLMsg__bindgen_ty_1),
            "::",
            stringify!(whatever)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).result) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CURLMsg__bindgen_ty_1),
            "::",
            stringify!(result)
        )
    );
}
#[test]
fn bindgen_test_layout_CURLMsg() {
    const UNINIT: ::std::mem::MaybeUninit<CURLMsg> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CURLMsg>(),
        24usize,
        concat!("Size of: ", stringify!(CURLMsg))
    );
    assert_eq!(
        ::std::mem::align_of::<CURLMsg>(),
        8usize,
        concat!("Alignment of ", stringify!(CURLMsg))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CURLMsg),
            "::",
            stringify!(msg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).easy_handle) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CURLMsg),
            "::",
            stringify!(easy_handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CURLMsg),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct curl_waitfd {
    pub fd: curl_socket_t,
    pub events: ::std::os::raw::c_short,
    pub revents: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_curl_waitfd() {
    const UNINIT: ::std::mem::MaybeUninit<curl_waitfd> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<curl_waitfd>(),
        8usize,
        concat!("Size of: ", stringify!(curl_waitfd))
    );
    assert_eq!(
        ::std::mem::align_of::<curl_waitfd>(),
        4usize,
        concat!("Alignment of ", stringify!(curl_waitfd))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_waitfd),
            "::",
            stringify!(fd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).events) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_waitfd),
            "::",
            stringify!(events)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).revents) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_waitfd),
            "::",
            stringify!(revents)
        )
    );
}
extern "C" {
    pub fn curl_multi_init() -> *mut CURLM;
}
extern "C" {
    pub fn curl_multi_add_handle(multi_handle: *mut CURLM, curl_handle: *mut CURL) -> CURLMcode;
}
extern "C" {
    pub fn curl_multi_remove_handle(multi_handle: *mut CURLM, curl_handle: *mut CURL) -> CURLMcode;
}
extern "C" {
    pub fn curl_multi_fdset(
        multi_handle: *mut CURLM,
        read_fd_set: *mut fd_set,
        write_fd_set: *mut fd_set,
        exc_fd_set: *mut fd_set,
        max_fd: *mut ::std::os::raw::c_int,
    ) -> CURLMcode;
}
extern "C" {
    pub fn curl_multi_wait(
        multi_handle: *mut CURLM,
        extra_fds: *mut curl_waitfd,
        extra_nfds: ::std::os::raw::c_uint,
        timeout_ms: ::std::os::raw::c_int,
        ret: *mut ::std::os::raw::c_int,
    ) -> CURLMcode;
}
extern "C" {
    pub fn curl_multi_poll(
        multi_handle: *mut CURLM,
        extra_fds: *mut curl_waitfd,
        extra_nfds: ::std::os::raw::c_uint,
        timeout_ms: ::std::os::raw::c_int,
        ret: *mut ::std::os::raw::c_int,
    ) -> CURLMcode;
}
extern "C" {
    pub fn curl_multi_wakeup(multi_handle: *mut CURLM) -> CURLMcode;
}
extern "C" {
    pub fn curl_multi_perform(
        multi_handle: *mut CURLM,
        running_handles: *mut ::std::os::raw::c_int,
    ) -> CURLMcode;
}
extern "C" {
    pub fn curl_multi_cleanup(multi_handle: *mut CURLM) -> CURLMcode;
}
extern "C" {
    pub fn curl_multi_info_read(
        multi_handle: *mut CURLM,
        msgs_in_queue: *mut ::std::os::raw::c_int,
    ) -> *mut CURLMsg;
}
extern "C" {
    pub fn curl_multi_strerror(arg1: CURLMcode) -> *const ::std::os::raw::c_char;
}
pub type curl_socket_callback = ::std::option::Option<
    unsafe extern "C" fn(
        easy: *mut CURL,
        s: curl_socket_t,
        what: ::std::os::raw::c_int,
        userp: *mut ::std::os::raw::c_void,
        socketp: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type curl_multi_timer_callback = ::std::option::Option<
    unsafe extern "C" fn(
        multi: *mut CURLM,
        timeout_ms: ::std::os::raw::c_long,
        userp: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn curl_multi_socket(
        multi_handle: *mut CURLM,
        s: curl_socket_t,
        running_handles: *mut ::std::os::raw::c_int,
    ) -> CURLMcode;
}
extern "C" {
    pub fn curl_multi_socket_action(
        multi_handle: *mut CURLM,
        s: curl_socket_t,
        ev_bitmask: ::std::os::raw::c_int,
        running_handles: *mut ::std::os::raw::c_int,
    ) -> CURLMcode;
}
extern "C" {
    pub fn curl_multi_socket_all(
        multi_handle: *mut CURLM,
        running_handles: *mut ::std::os::raw::c_int,
    ) -> CURLMcode;
}
extern "C" {
    pub fn curl_multi_timeout(
        multi_handle: *mut CURLM,
        milliseconds: *mut ::std::os::raw::c_long,
    ) -> CURLMcode;
}
pub const CURLMoption_CURLMOPT_SOCKETFUNCTION: CURLMoption = 20001;
pub const CURLMoption_CURLMOPT_SOCKETDATA: CURLMoption = 10002;
pub const CURLMoption_CURLMOPT_PIPELINING: CURLMoption = 3;
pub const CURLMoption_CURLMOPT_TIMERFUNCTION: CURLMoption = 20004;
pub const CURLMoption_CURLMOPT_TIMERDATA: CURLMoption = 10005;
pub const CURLMoption_CURLMOPT_MAXCONNECTS: CURLMoption = 6;
pub const CURLMoption_CURLMOPT_MAX_HOST_CONNECTIONS: CURLMoption = 7;
pub const CURLMoption_CURLMOPT_MAX_PIPELINE_LENGTH: CURLMoption = 8;
pub const CURLMoption_CURLMOPT_CONTENT_LENGTH_PENALTY_SIZE: CURLMoption = 30009;
pub const CURLMoption_CURLMOPT_CHUNK_LENGTH_PENALTY_SIZE: CURLMoption = 30010;
pub const CURLMoption_CURLMOPT_PIPELINING_SITE_BL: CURLMoption = 10011;
pub const CURLMoption_CURLMOPT_PIPELINING_SERVER_BL: CURLMoption = 10012;
pub const CURLMoption_CURLMOPT_MAX_TOTAL_CONNECTIONS: CURLMoption = 13;
pub const CURLMoption_CURLMOPT_PUSHFUNCTION: CURLMoption = 20014;
pub const CURLMoption_CURLMOPT_PUSHDATA: CURLMoption = 10015;
pub const CURLMoption_CURLMOPT_MAX_CONCURRENT_STREAMS: CURLMoption = 16;
pub const CURLMoption_CURLMOPT_NETWORK_CHANGED: CURLMoption = 17;
pub const CURLMoption_CURLMOPT_NOTIFYFUNCTION: CURLMoption = 20018;
pub const CURLMoption_CURLMOPT_NOTIFYDATA: CURLMoption = 10019;
pub const CURLMoption_CURLMOPT_LASTENTRY: CURLMoption = 10020;
pub type CURLMoption = ::std::os::raw::c_uint;
extern "C" {
    pub fn curl_multi_setopt(multi_handle: *mut CURLM, option: CURLMoption, ...) -> CURLMcode;
}
extern "C" {
    pub fn curl_multi_assign(
        multi_handle: *mut CURLM,
        sockfd: curl_socket_t,
        sockp: *mut ::std::os::raw::c_void,
    ) -> CURLMcode;
}
extern "C" {
    pub fn curl_multi_get_handles(multi_handle: *mut CURLM) -> *mut *mut CURL;
}
pub const CURLMinfo_offt_CURLMINFO_NONE: CURLMinfo_offt = 0;
pub const CURLMinfo_offt_CURLMINFO_XFERS_CURRENT: CURLMinfo_offt = 1;
pub const CURLMinfo_offt_CURLMINFO_XFERS_RUNNING: CURLMinfo_offt = 2;
pub const CURLMinfo_offt_CURLMINFO_XFERS_PENDING: CURLMinfo_offt = 3;
pub const CURLMinfo_offt_CURLMINFO_XFERS_DONE: CURLMinfo_offt = 4;
pub const CURLMinfo_offt_CURLMINFO_XFERS_ADDED: CURLMinfo_offt = 5;
pub const CURLMinfo_offt_CURLMINFO_LASTENTRY: CURLMinfo_offt = 6;
pub type CURLMinfo_offt = ::std::os::raw::c_uint;
extern "C" {
    pub fn curl_multi_get_offt(
        multi_handle: *mut CURLM,
        info: CURLMinfo_offt,
        pvalue: *mut curl_off_t,
    ) -> CURLMcode;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct curl_pushheaders {
    _unused: [u8; 0],
}
extern "C" {
    pub fn curl_pushheader_bynum(
        h: *mut curl_pushheaders,
        num: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn curl_pushheader_byname(
        h: *mut curl_pushheaders,
        name: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type curl_push_callback = ::std::option::Option<
    unsafe extern "C" fn(
        parent: *mut CURL,
        easy: *mut CURL,
        num_headers: usize,
        headers: *mut curl_pushheaders,
        userp: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn curl_multi_waitfds(
        multi: *mut CURLM,
        ufds: *mut curl_waitfd,
        size: ::std::os::raw::c_uint,
        fd_count: *mut ::std::os::raw::c_uint,
    ) -> CURLMcode;
}
pub type curl_notify_callback = ::std::option::Option<
    unsafe extern "C" fn(
        multi: *mut CURLM,
        notification: ::std::os::raw::c_uint,
        easy: *mut CURL,
        user_data: *mut ::std::os::raw::c_void,
    ),
>;
extern "C" {
    pub fn curl_multi_notify_disable(
        multi: *mut CURLM,
        notification: ::std::os::raw::c_uint,
    ) -> CURLMcode;
}
extern "C" {
    pub fn curl_multi_notify_enable(
        multi: *mut CURLM,
        notification: ::std::os::raw::c_uint,
    ) -> CURLMcode;
}
pub const CURLUcode_CURLUE_OK: CURLUcode = 0;
pub const CURLUcode_CURLUE_BAD_HANDLE: CURLUcode = 1;
pub const CURLUcode_CURLUE_BAD_PARTPOINTER: CURLUcode = 2;
pub const CURLUcode_CURLUE_MALFORMED_INPUT: CURLUcode = 3;
pub const CURLUcode_CURLUE_BAD_PORT_NUMBER: CURLUcode = 4;
pub const CURLUcode_CURLUE_UNSUPPORTED_SCHEME: CURLUcode = 5;
pub const CURLUcode_CURLUE_URLDECODE: CURLUcode = 6;
pub const CURLUcode_CURLUE_OUT_OF_MEMORY: CURLUcode = 7;
pub const CURLUcode_CURLUE_USER_NOT_ALLOWED: CURLUcode = 8;
pub const CURLUcode_CURLUE_UNKNOWN_PART: CURLUcode = 9;
pub const CURLUcode_CURLUE_NO_SCHEME: CURLUcode = 10;
pub const CURLUcode_CURLUE_NO_USER: CURLUcode = 11;
pub const CURLUcode_CURLUE_NO_PASSWORD: CURLUcode = 12;
pub const CURLUcode_CURLUE_NO_OPTIONS: CURLUcode = 13;
pub const CURLUcode_CURLUE_NO_HOST: CURLUcode = 14;
pub const CURLUcode_CURLUE_NO_PORT: CURLUcode = 15;
pub const CURLUcode_CURLUE_NO_QUERY: CURLUcode = 16;
pub const CURLUcode_CURLUE_NO_FRAGMENT: CURLUcode = 17;
pub const CURLUcode_CURLUE_NO_ZONEID: CURLUcode = 18;
pub const CURLUcode_CURLUE_BAD_FILE_URL: CURLUcode = 19;
pub const CURLUcode_CURLUE_BAD_FRAGMENT: CURLUcode = 20;
pub const CURLUcode_CURLUE_BAD_HOSTNAME: CURLUcode = 21;
pub const CURLUcode_CURLUE_BAD_IPV6: CURLUcode = 22;
pub const CURLUcode_CURLUE_BAD_LOGIN: CURLUcode = 23;
pub const CURLUcode_CURLUE_BAD_PASSWORD: CURLUcode = 24;
pub const CURLUcode_CURLUE_BAD_PATH: CURLUcode = 25;
pub const CURLUcode_CURLUE_BAD_QUERY: CURLUcode = 26;
pub const CURLUcode_CURLUE_BAD_SCHEME: CURLUcode = 27;
pub const CURLUcode_CURLUE_BAD_SLASHES: CURLUcode = 28;
pub const CURLUcode_CURLUE_BAD_USER: CURLUcode = 29;
pub const CURLUcode_CURLUE_LACKS_IDN: CURLUcode = 30;
pub const CURLUcode_CURLUE_TOO_LARGE: CURLUcode = 31;
pub const CURLUcode_CURLUE_LAST: CURLUcode = 32;
pub type CURLUcode = ::std::os::raw::c_uint;
pub const CURLUPart_CURLUPART_URL: CURLUPart = 0;
pub const CURLUPart_CURLUPART_SCHEME: CURLUPart = 1;
pub const CURLUPart_CURLUPART_USER: CURLUPart = 2;
pub const CURLUPart_CURLUPART_PASSWORD: CURLUPart = 3;
pub const CURLUPart_CURLUPART_OPTIONS: CURLUPart = 4;
pub const CURLUPart_CURLUPART_HOST: CURLUPart = 5;
pub const CURLUPart_CURLUPART_PORT: CURLUPart = 6;
pub const CURLUPart_CURLUPART_PATH: CURLUPart = 7;
pub const CURLUPart_CURLUPART_QUERY: CURLUPart = 8;
pub const CURLUPart_CURLUPART_FRAGMENT: CURLUPart = 9;
pub const CURLUPart_CURLUPART_ZONEID: CURLUPart = 10;
pub type CURLUPart = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Curl_URL {
    _unused: [u8; 0],
}
pub type CURLU = Curl_URL;
extern "C" {
    pub fn curl_url() -> *mut CURLU;
}
extern "C" {
    pub fn curl_url_cleanup(handle: *mut CURLU);
}
extern "C" {
    pub fn curl_url_dup(in_: *const CURLU) -> *mut CURLU;
}
extern "C" {
    pub fn curl_url_get(
        handle: *const CURLU,
        what: CURLUPart,
        part: *mut *mut ::std::os::raw::c_char,
        flags: ::std::os::raw::c_uint,
    ) -> CURLUcode;
}
extern "C" {
    pub fn curl_url_set(
        handle: *mut CURLU,
        what: CURLUPart,
        part: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_uint,
    ) -> CURLUcode;
}
extern "C" {
    pub fn curl_url_strerror(arg1: CURLUcode) -> *const ::std::os::raw::c_char;
}
pub const curl_easytype_CURLOT_LONG: curl_easytype = 0;
pub const curl_easytype_CURLOT_VALUES: curl_easytype = 1;
pub const curl_easytype_CURLOT_OFF_T: curl_easytype = 2;
pub const curl_easytype_CURLOT_OBJECT: curl_easytype = 3;
pub const curl_easytype_CURLOT_STRING: curl_easytype = 4;
pub const curl_easytype_CURLOT_SLIST: curl_easytype = 5;
pub const curl_easytype_CURLOT_CBPTR: curl_easytype = 6;
pub const curl_easytype_CURLOT_BLOB: curl_easytype = 7;
pub const curl_easytype_CURLOT_FUNCTION: curl_easytype = 8;
pub type curl_easytype = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct curl_easyoption {
    pub name: *const ::std::os::raw::c_char,
    pub id: CURLoption,
    pub type_: curl_easytype,
    pub flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_curl_easyoption() {
    const UNINIT: ::std::mem::MaybeUninit<curl_easyoption> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<curl_easyoption>(),
        24usize,
        concat!("Size of: ", stringify!(curl_easyoption))
    );
    assert_eq!(
        ::std::mem::align_of::<curl_easyoption>(),
        8usize,
        concat!("Alignment of ", stringify!(curl_easyoption))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_easyoption),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_easyoption),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_easyoption),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_easyoption),
            "::",
            stringify!(flags)
        )
    );
}
extern "C" {
    pub fn curl_easy_option_by_name(name: *const ::std::os::raw::c_char) -> *const curl_easyoption;
}
extern "C" {
    pub fn curl_easy_option_by_id(id: CURLoption) -> *const curl_easyoption;
}
extern "C" {
    pub fn curl_easy_option_next(prev: *const curl_easyoption) -> *const curl_easyoption;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct curl_header {
    pub name: *mut ::std::os::raw::c_char,
    pub value: *mut ::std::os::raw::c_char,
    pub amount: usize,
    pub index: usize,
    pub origin: ::std::os::raw::c_uint,
    pub anchor: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_curl_header() {
    const UNINIT: ::std::mem::MaybeUninit<curl_header> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<curl_header>(),
        48usize,
        concat!("Size of: ", stringify!(curl_header))
    );
    assert_eq!(
        ::std::mem::align_of::<curl_header>(),
        8usize,
        concat!("Alignment of ", stringify!(curl_header))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_header),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_header),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).amount) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_header),
            "::",
            stringify!(amount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).index) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_header),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).origin) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_header),
            "::",
            stringify!(origin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).anchor) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_header),
            "::",
            stringify!(anchor)
        )
    );
}
pub const CURLHcode_CURLHE_OK: CURLHcode = 0;
pub const CURLHcode_CURLHE_BADINDEX: CURLHcode = 1;
pub const CURLHcode_CURLHE_MISSING: CURLHcode = 2;
pub const CURLHcode_CURLHE_NOHEADERS: CURLHcode = 3;
pub const CURLHcode_CURLHE_NOREQUEST: CURLHcode = 4;
pub const CURLHcode_CURLHE_OUT_OF_MEMORY: CURLHcode = 5;
pub const CURLHcode_CURLHE_BAD_ARGUMENT: CURLHcode = 6;
pub const CURLHcode_CURLHE_NOT_BUILT_IN: CURLHcode = 7;
pub type CURLHcode = ::std::os::raw::c_uint;
extern "C" {
    pub fn curl_easy_header(
        easy: *mut CURL,
        name: *const ::std::os::raw::c_char,
        index: usize,
        origin: ::std::os::raw::c_uint,
        request: ::std::os::raw::c_int,
        hout: *mut *mut curl_header,
    ) -> CURLHcode;
}
extern "C" {
    pub fn curl_easy_nextheader(
        easy: *mut CURL,
        origin: ::std::os::raw::c_uint,
        request: ::std::os::raw::c_int,
        prev: *mut curl_header,
    ) -> *mut curl_header;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct curl_ws_frame {
    pub age: ::std::os::raw::c_int,
    pub flags: ::std::os::raw::c_int,
    pub offset: curl_off_t,
    pub bytesleft: curl_off_t,
    pub len: usize,
}
#[test]
fn bindgen_test_layout_curl_ws_frame() {
    const UNINIT: ::std::mem::MaybeUninit<curl_ws_frame> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<curl_ws_frame>(),
        32usize,
        concat!("Size of: ", stringify!(curl_ws_frame))
    );
    assert_eq!(
        ::std::mem::align_of::<curl_ws_frame>(),
        8usize,
        concat!("Alignment of ", stringify!(curl_ws_frame))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).age) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_ws_frame),
            "::",
            stringify!(age)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_ws_frame),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_ws_frame),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bytesleft) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_ws_frame),
            "::",
            stringify!(bytesleft)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(curl_ws_frame),
            "::",
            stringify!(len)
        )
    );
}
extern "C" {
    pub fn curl_ws_recv(
        curl: *mut CURL,
        buffer: *mut ::std::os::raw::c_void,
        buflen: usize,
        recv: *mut usize,
        metap: *mut *const curl_ws_frame,
    ) -> CURLcode;
}
extern "C" {
    pub fn curl_ws_send(
        curl: *mut CURL,
        buffer: *const ::std::os::raw::c_void,
        buflen: usize,
        sent: *mut usize,
        fragsize: curl_off_t,
        flags: ::std::os::raw::c_uint,
    ) -> CURLcode;
}
extern "C" {
    pub fn curl_ws_start_frame(
        curl: *mut CURL,
        flags: ::std::os::raw::c_uint,
        frame_len: curl_off_t,
    ) -> CURLcode;
}
extern "C" {
    pub fn curl_ws_meta(curl: *mut CURL) -> *const curl_ws_frame;
}
extern "C" {
    pub fn curl_mprintf(format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn curl_mfprintf(
        fd: *mut FILE,
        format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn curl_msprintf(
        buffer: *mut ::std::os::raw::c_char,
        format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn curl_msnprintf(
        buffer: *mut ::std::os::raw::c_char,
        maxlength: usize,
        format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn curl_mvprintf(
        format: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn curl_mvfprintf(
        fd: *mut FILE,
        format: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn curl_mvsprintf(
        buffer: *mut ::std::os::raw::c_char,
        format: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn curl_mvsnprintf(
        buffer: *mut ::std::os::raw::c_char,
        maxlength: usize,
        format: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn curl_maprintf(format: *const ::std::os::raw::c_char, ...)
        -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn curl_mvaprintf(
        format: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> *mut ::std::os::raw::c_char;
}
pub type Wcurl_read_callback1 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: usize,
        arg4: *mut ::std::os::raw::c_void,
    ) -> usize,
>;
pub type Wcurl_read_callback2 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: usize,
        arg4: *const ::std::os::raw::c_void,
    ) -> usize,
>;
pub type Wcurl_read_callback3 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: usize,
        arg4: *mut FILE,
    ) -> usize,
>;
pub type Wcurl_read_callback4 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: usize,
        arg3: usize,
        arg4: *mut ::std::os::raw::c_void,
    ) -> usize,
>;
pub type Wcurl_read_callback5 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: usize,
        arg3: usize,
        arg4: *const ::std::os::raw::c_void,
    ) -> usize,
>;
pub type Wcurl_read_callback6 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: usize,
        arg3: usize,
        arg4: *mut FILE,
    ) -> usize,
>;
pub type Wcurl_write_callback1 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_char,
        arg2: usize,
        arg3: usize,
        arg4: *mut ::std::os::raw::c_void,
    ) -> usize,
>;
pub type Wcurl_write_callback2 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_char,
        arg2: usize,
        arg3: usize,
        arg4: *const ::std::os::raw::c_void,
    ) -> usize,
>;
pub type Wcurl_write_callback3 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_char,
        arg2: usize,
        arg3: usize,
        arg4: *mut FILE,
    ) -> usize,
>;
pub type Wcurl_write_callback4 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: usize,
        arg3: usize,
        arg4: *mut ::std::os::raw::c_void,
    ) -> usize,
>;
pub type Wcurl_write_callback5 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: usize,
        arg3: usize,
        arg4: *const ::std::os::raw::c_void,
    ) -> usize,
>;
pub type Wcurl_write_callback6 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: usize,
        arg3: usize,
        arg4: *mut FILE,
    ) -> usize,
>;
pub type Wcurl_ioctl_callback1 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut CURL,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_void,
    ) -> curlioerr,
>;
pub type Wcurl_ioctl_callback2 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut CURL,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_void,
    ) -> curlioerr,
>;
pub type Wcurl_ioctl_callback3 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut CURL,
        arg2: curliocmd,
        arg3: *mut ::std::os::raw::c_void,
    ) -> curlioerr,
>;
pub type Wcurl_ioctl_callback4 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut CURL,
        arg2: curliocmd,
        arg3: *const ::std::os::raw::c_void,
    ) -> curlioerr,
>;
pub type Wcurl_sockopt_callback1 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: curl_socket_t,
        arg3: curlsocktype,
    ) -> ::std::os::raw::c_int,
>;
pub type Wcurl_sockopt_callback2 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: curl_socket_t,
        arg3: curlsocktype,
    ) -> ::std::os::raw::c_int,
>;
pub type Wcurl_opensocket_callback1 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: curlsocktype,
        arg3: *mut curl_sockaddr,
    ) -> curl_socket_t,
>;
pub type Wcurl_opensocket_callback2 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: curlsocktype,
        arg3: *const curl_sockaddr,
    ) -> curl_socket_t,
>;
pub type Wcurl_opensocket_callback3 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: curlsocktype,
        arg3: *mut curl_sockaddr,
    ) -> curl_socket_t,
>;
pub type Wcurl_opensocket_callback4 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: curlsocktype,
        arg3: *const curl_sockaddr,
    ) -> curl_socket_t,
>;
pub type Wcurl_progress_callback1 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: f64,
        arg3: f64,
        arg4: f64,
        arg5: f64,
    ) -> ::std::os::raw::c_int,
>;
pub type Wcurl_progress_callback2 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: f64,
        arg3: f64,
        arg4: f64,
        arg5: f64,
    ) -> ::std::os::raw::c_int,
>;
pub type Wcurl_debug_callback1 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut CURL,
        arg2: curl_infotype,
        arg3: *mut ::std::os::raw::c_char,
        arg4: usize,
        arg5: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type Wcurl_debug_callback2 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut CURL,
        arg2: curl_infotype,
        arg3: *mut ::std::os::raw::c_char,
        arg4: usize,
        arg5: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type Wcurl_debug_callback3 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut CURL,
        arg2: curl_infotype,
        arg3: *const ::std::os::raw::c_char,
        arg4: usize,
        arg5: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type Wcurl_debug_callback4 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut CURL,
        arg2: curl_infotype,
        arg3: *const ::std::os::raw::c_char,
        arg4: usize,
        arg5: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type Wcurl_debug_callback5 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut CURL,
        arg2: curl_infotype,
        arg3: *mut ::std::os::raw::c_uchar,
        arg4: usize,
        arg5: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type Wcurl_debug_callback6 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut CURL,
        arg2: curl_infotype,
        arg3: *mut ::std::os::raw::c_uchar,
        arg4: usize,
        arg5: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type Wcurl_debug_callback7 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut CURL,
        arg2: curl_infotype,
        arg3: *const ::std::os::raw::c_uchar,
        arg4: usize,
        arg5: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type Wcurl_debug_callback8 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut CURL,
        arg2: curl_infotype,
        arg3: *const ::std::os::raw::c_uchar,
        arg4: usize,
        arg5: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type Wcurl_ssl_ctx_callback1 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut CURL,
        arg2: *mut ::std::os::raw::c_void,
        arg3: *mut ::std::os::raw::c_void,
    ) -> CURLcode,
>;
pub type Wcurl_ssl_ctx_callback2 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut CURL,
        arg2: *mut ::std::os::raw::c_void,
        arg3: *const ::std::os::raw::c_void,
    ) -> CURLcode,
>;
pub type Wcurl_ssl_ctx_callback3 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut CURL,
        arg2: *const ::std::os::raw::c_void,
        arg3: *mut ::std::os::raw::c_void,
    ) -> CURLcode,
>;
pub type Wcurl_ssl_ctx_callback4 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut CURL,
        arg2: *const ::std::os::raw::c_void,
        arg3: *const ::std::os::raw::c_void,
    ) -> CURLcode,
>;
pub type Wcurl_ssl_ctx_callback5 = Wcurl_ssl_ctx_callback1;
pub type Wcurl_ssl_ctx_callback6 = Wcurl_ssl_ctx_callback1;
pub type Wcurl_ssl_ctx_callback7 = Wcurl_ssl_ctx_callback1;
pub type Wcurl_ssl_ctx_callback8 = Wcurl_ssl_ctx_callback1;
pub type Wcurl_conv_callback1 = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_char, length: usize) -> CURLcode,
>;
pub type Wcurl_conv_callback2 = ::std::option::Option<
    unsafe extern "C" fn(arg1: *const ::std::os::raw::c_char, length: usize) -> CURLcode,
>;
pub type Wcurl_conv_callback3 = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, length: usize) -> CURLcode,
>;
pub type Wcurl_conv_callback4 = ::std::option::Option<
    unsafe extern "C" fn(arg1: *const ::std::os::raw::c_void, length: usize) -> CURLcode,
>;
pub type Wcurl_seek_callback1 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: curl_off_t,
        arg3: ::std::os::raw::c_int,
    ) -> CURLcode,
>;
pub type Wcurl_seek_callback2 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: curl_off_t,
        arg3: ::std::os::raw::c_int,
    ) -> CURLcode,
>;
pub type Wcurl_chunk_bgn_callback1 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut curl_fileinfo,
        arg2: *mut ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long,
>;
pub type Wcurl_chunk_bgn_callback2 = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long,
>;
pub type Wcurl_interleave_callback1 = ::std::option::Option<
    unsafe extern "C" fn(
        p: *mut ::std::os::raw::c_void,
        s: usize,
        n: usize,
        u: *mut ::std::os::raw::c_void,
    ) -> usize,
>;
pub type Wcurl_interleave_callback2 = ::std::option::Option<
    unsafe extern "C" fn(
        p: *mut ::std::os::raw::c_char,
        s: usize,
        n: usize,
        u: *mut ::std::os::raw::c_void,
    ) -> usize,
>;
pub type __builtin_va_list = [__va_list_tag; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __va_list_tag {
    pub gp_offset: ::std::os::raw::c_uint,
    pub fp_offset: ::std::os::raw::c_uint,
    pub overflow_arg_area: *mut ::std::os::raw::c_void,
    pub reg_save_area: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout___va_list_tag() {
    const UNINIT: ::std::mem::MaybeUninit<__va_list_tag> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__va_list_tag>(),
        24usize,
        concat!("Size of: ", stringify!(__va_list_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<__va_list_tag>(),
        8usize,
        concat!("Alignment of ", stringify!(__va_list_tag))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gp_offset) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(gp_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_offset) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(fp_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).overflow_arg_area) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(overflow_arg_area)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reg_save_area) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(reg_save_area)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_data {
    pub _address: u8,
}
